Repository: ATHIRADI/Seeku-Health-Calculator-Flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, hi, ja, ko, pt, ru, zh

# safetyInfoText
source: • Never drink and drive • BAC is an estimate, not a precise measurement • Individual metabolism varies • Consult local laws regarding legal BAC limits
ar: • لا تقد أبدًا تحت تأثير الكحول • نسبة الكحول تقديرية وليست دقيقة • التمثيل الغذائي يختلف من شخص لآخر • استشر القوانين المحلية المتعلقة بحدود الكحول
de: • Fahren Sie niemals unter Alkoholeinfluss • BAK ist eine Schätzung, keine genaue Messung • Individueller Stoffwechsel variiert • Konsultieren Sie lokale Gesetze zu BAK-Grenzwerten
es: • Nunca conduzca bajo los efectos del alcohol • CAS es una estimación, no una medición precisa • El metabolismo individual varía • Consulte las leyes locales sobre límites de CAS
fr: • Ne conduisez jamais sous l'emprise de l'alcool • Le TAC est une estimation, pas une mesure précise • Le métabolisme individuel varie • Consultez les lois locales sur les limites de TAC
hi: • कभी भी शराब के प्रभाव में गाड़ी न चलाएं • रक्त शराब सामग्री एक अनुमान है, सटीक माप नहीं • व्यक्तिगत चयापचय भिन्न होता है • रक्त शराब सामग्री की सीमाओं के लिए स्थानीय कानूनों से परामर्श करें
ja: • 絶対に飲酒運転をしないでください • 血中アルコール濃度は推定値であり、正確な測定ではありません • 個人の代謝は異なります • 地域の法律による血中アルコール濃度制限を確認してください
ko: • 절대 음주 운전하지 마세요 • 혈중 알코올 농도는 추정치일 뿐, 정확한 측정이 아닙니다 • 개인의 대사는 다양합니다 • 지역 법률의 혈중 알코올 농도 제한을 확인하세요
pt: • Nunca dirija sob efeito de álcool • TAS é uma estimativa, não uma medição precisa • Metabolismo individual varia • Consulte as leis locais sobre limites de TAS
ru: • Никогда не садитесь за руль в состоянии опьянения • СОК - это оценка, а не точное измерение • Индивидуальный метаболизм различается • Проконсультируйтесь с местными законами о пределах СОК
zh: • 切勿酒后驾驶 • 血液酒精含量为估算值，非精确测量 • 个人新陈代谢各不相同 • 请查阅当地关于血液酒精含量限制的法律

# drinkTypeBeer
source: Beer (5% ABV)
ar: بيرة (5٪ كحول)
de: Bier (5% Alkohol)
es: Cerveza (5% de alcohol)
fr: Bière (5% d'alcool)
hi: बीयर (5% शराब)
ja: ビール（アルコール度数5%）
ko: 맥주 (알코올 5%)
pt: Cerveja (5% de álcool)
ru: Пиво (5% алкоголя)
zh: 啤酒（5%酒精）

# drinkTypeWine
source: Wine (12% ABV)
ar: نبيذ (12٪ كحول)
de: Wein (12% Alkohol)
es: Vino (12% de alcohol)
fr: Vin (12% d'alcool)
hi: वाइन (12% शराब)
ja: ワイン（アルコール度数12%）
ko: 와인 (알코올 12%)
pt: Vinho (12% de álcool)
ru: Вино (12% алкоголя)
zh: 葡萄酒（12%酒精）

# drinkTypeSpirits
source: Spirits (40% ABV)
ar: مشروبات كحولية (40٪ كحول)
de: Spirituosen (40% Alkohol)
es: Licores (40% de alcohol)
fr: Spiritueux (40% d'alcool)
hi: स्पिरिट्स (40% शराब)
ja: 蒸留酒（アルコール度数40%）
ko: 증류주 (알코올 40%)
pt: Destilados (40% de álcool)
ru: Крепкие напитки (40% алкоголя)
zh: 烈酒（40%酒精）

# atBACLevel
source: At {bac}% BAC
ar: عند {bac}% نسبة الكحول
de: Bei {bac}% BAC
es: A {bac}% de BAC
fr: À {bac}% d'alcoolémie
hi: {bac}% BAC पर
ja: {bac}% のBACで
ko: {bac}% BAC에서
pt: A {bac}% de BAC
ru: При {bac}% содержания алкоголя
zh: 在 {bac}% 的血液酒精浓度时

# bloodPressureCalculatorTitle
source: Blood Pressure Calculator
ar: آلة حاسبة لضغط الدم
de: Blutdruckrechner
es: Calculadora de Presión Arterial
fr: Calculateur de tension artérielle
hi: रक्तचाप कैलकुलेटर
ja: 血圧計算機
ko: 혈압 계산기
pt: Calculadora de Pressão Arterial
ru: Калькулятор артериального давления
zh: 血压计算器

# calculateBloodPressureDescription
source: Calculate and understand your blood pressure
ar: احسب وفهم ضغط دمك
de: Berechnen und verstehen Sie Ihren Blutdruck
es: Calcula y comprende tu presión arterial
fr: Calculez et comprenez votre tension artérielle
hi: अपना रक्तचाप जानें और समझें
ja: 血圧を計算して理解しましょう
ko: 혈압을 계산하고 이해하세요
pt: Calcule e entenda sua pressão arterial
ru: Рассчитайте и поймите свое артериальное давление
zh: 计算并了解您的血压

# measurementMethodLabel
source: Measurement Method
ar: طريقة القياس
de: Messmethode
es: Método de medición
fr: Méthode de mesure
hi: मापने की विधि
ja: 測定方法
ko: 측정 방법
pt: Método de medição
ru: Способ измерения
zh: 测量方法

# measurementMethodManual
source: Manual Entry
ar: الإدخال اليدوي
de: Manuelle Eingabe
es: Entrada manual
fr: Saisie manuelle
hi: मैन्युअल एंट्री
ja: 手動入力
ko: 수동 입력
pt: Entrada manual
ru: Ввод вручную
zh: 手动输入

# measurementMethodDevice
source: Blood Pressure Device
ar: جهاز قياس ضغط الدم
de: Blutdruckmessgerät
es: Dispositivo de presión arterial
fr: Appareil de mesure de la tension
hi: रक्तचाप मापने का उपकरण
ja: 血圧計
ko: 혈압 측정기
pt: Aparelho de Pressão Arterial
ru: Прибор для измерения давления
zh: 血压测量仪

# calculateBloodPressureButton
source: Calculate Blood Pressure
ar: احسب ضغط الدم
de: Blutdruck berechnen
es: Calcular Presión Arterial
fr: Calculer la tension artérielle
hi: रक्तचाप की गणना करें
ja: 血圧を計算する
ko: 혈압 계산하기
pt: Calcular Pressão Arterial
ru: Рассчитать давление
zh: 计算血压

# bloodPressureReadingTitle
source: Blood Pressure Reading
ar: قياس ضغط الدم
de: Blutdruckmessung
es: Lectura de Presión Arterial
fr: Lecture de la tension artérielle
hi: रक्तचाप माप
ja: 血圧測定値
ko: 혈압 측정
pt: Leitura de Pressão Arterial
ru: Показатели артериального давления
zh: 血压读数

# bloodPressureCategoryLabel
source: Category
ar: الفئة
de: Kategorie
es: Categoría
fr: Catégorie
hi: श्रेणी
ja: カテゴリー
ko: 카테고리
pt: Categoria
ru: Категория
zh: 类别

# bloodPressureCategoriesTitle
source: Blood Pressure Categories
ar: فئات ضغط الدم
de: Blutdruckkategorien
es: Categorías de Presión Arterial
fr: Catégories de tension artérielle
hi: रक्तचाप श्रेणियां
ja: 血圧カテゴリー
ko: 혈압 카테고리
pt: Categorias de Pressão Arterial
ru: Категории артериального давления
zh: 血压类别

# bloodPressureCategoryHypotension
source: Hypotension
ar: انخفاض ضغط الدم
de: Hypotonie
es: Hipotensión
hi: निम्न रक्तचाप
ja: 低血圧
ko: 저혈압
pt: Hipotensão
ru: Гипотония
zh: 低血压

# bloodPressureCategoryNormal
source: Normal
ar: طبيعي
fr: Normale
hi: सामान्य
ja: 正常
ko: 정상
ru: Норма
zh: 正常

# bloodPressureCategoryElevated
source: Elevated
ar: مرتفع قليلًا
de: Erhöht
es: Elevada
fr: Élevée
hi: उच्च रक्तचाप की पूर्व अवस्था
ja: 高め
ko: 상승
pt: Elevada
ru: Повышенное
zh: 偏高

# bloodPressureCategoryHypertensionStage1
source: Hypertension Stage 1
ar: ارتفاع ضغط الدم المرحلي 1
de: Hypertonie Stufe 1
es: Hipertensión Etapa 1
fr: Hypertension stade 1
hi: उच्च रक्तचाप चरण 1
ja: 高血圧ステージ1
ko: 고혈압 1단계
pt: Hipertensão Estágio 1
ru: Гипертония 1 стадии
zh: 高血压第一期

# bloodPressureCategoryHypertensionStage2
source: Hypertension Stage 2
ar: ارتفاع ضغط الدم المرحلي 2
de: Hypertonie Stufe 2
es: Hipertensión Etapa 2
fr: Hypertension stade 2
hi: उच्च रक्तचाप चरण 2
ja: 高血圧ステージ2
ko: 고혈압 2단계
pt: Hipertensão Estágio 2
ru: Гипертония 2 стадии
zh: 高血压第二期

# bloodPressureCategoryHypertensiveCrisis
source: Hypertensive Crisis
ar: أزمة ارتفاع ضغط الدم
de: Hypertensive Krise
es: Crisis Hipertensiva
fr: Crise hypertensive
hi: उच्च रक्तचाप संकट
ja: 高血圧緊急事態
ko: 고혈압 응급상태
pt: Crise Hipertensiva
ru: Гипертонический криз
zh: 高血压危象

# bloodPressureInputError
source: Please ensure blood pressure values are within a valid range.
ar: يرجى التأكد من أن قيم ضغط الدم ضمن النطاق الصحيح.
de: Bitte stellen Sie sicher, dass die Blutdruckwerte in einem gültigen Bereich liegen.
es: Por favor, asegúrate de que los valores de presión arterial estén dentro de un rango válido.
fr: Veuillez vous assurer que les valeurs de tension artérielle sont dans une plage valide.
hi: कृपया सुनिश्चित करें कि रक्तचाप मान सही सीमा के भीतर हैं।
ja: 血圧の値が有効範囲内であることを確認してください。
ko: 혈압 값이 유효 범위 내에 있는지 확인하세요.
pt: Certifique-se de que os valores de pressão arterial estejam em um intervalo válido.
ru: Убедитесь, что значения давления находятся в допустимом диапазоне.
zh: 请确保血压数值在有效范围内。

# breathCountCalculatorTitle
source: Breath Count Calculator
ar: آلة حاسبة لعدد الأنفاس
de: Atemfrequenz-Rechner
es: Calculadora de Frecuencia Respiratoria
fr: Calculateur du nombre de respirations
hi: Calculateur du nombre de respirations
ja: 呼吸回数計算機
ko: 호흡 수 계산기
pt: Calculadora de Frequência Respiratória
ru: Счётчик частоты дыхания
zh: 呼吸次数计算器

# breathCountDescription
source: Count your breaths to measure respiratory rate
ar: احسب أنفاسك لقياس معدل التنفس
de: Zählen Sie Ihre Atemzüge, um Ihre Atemfrequenz zu messen
es: Cuenta tus respiraciones para medir la frecuencia respiratoria
fr: Comptez vos respirations pour mesurer votre fréquence respiratoire
hi: Comptez vos respirations pour mesurer votre fréquence respiratoire
ja: 呼吸回数を数えて呼吸数を測定しましょう
ko: 호흡 수를 측정하여 호흡수를 확인하세요
pt: Conte suas respirações para medir a frequência respiratória
ru: Считайте свои вдохи, чтобы измерить частоту дыхания
zh: 通过数呼吸来测量呼吸频率

# measurementDurationLabel
source: Measurement Duration
ar: مدة القياس
de: Messdauer
es: Duración de la medición
fr: Durée de la mesure
hi: Durée de la mesure
ja: 計測時間
ko: 측정 시간
pt: Duração da medição
ru: Продолжительность измерения
zh: 测量时长

# ageGroupLabel
source: Age Group
ar: الفئة العمرية
de: Altersgruppe
es: Grupo de edad
fr: Groupe d'âge
hi: Groupe d'âge
ja: 年齢層
ko: 연령대
pt: Faixa etária
ru: Возрастная группа
zh: 年龄组

# adultLabel
source: Adult
ar: بالغ
de: Erwachsener
es: Adulto
fr: Adulte
hi: Adulte
ja: 大人
ko: 성인
pt: Adulto
ru: Взрослый
zh: 成人

# childLabel
source: Child
ar: طفل
de: Kind
es: Niño
fr: Enfant
hi: Enfant
ja: 子ども
ko: 어린이
pt: Criança
ru: Ребёнок
zh: 儿童

# tapToCountBreathsLabel
source: Tap to Count Breaths
ar: اضغط لعد الأنفاس
de: Tippen, um Atemzüge zu zählen
es: Toca para contar respiraciones
fr: Appuyez pour compter les respirations
hi: Appuyez pour compter les respirations
ja: タップして呼吸をカウント
ko: 호흡을 세기 위해 탭하세요
pt: Toque para contar as respirações
ru: Нажмите, чтобы считать вдохи
zh: 点击计数呼吸

# prepareToCountBreathsLabel
source: Prepare to Count Breaths
ar: استعد لعد الأنفاس
de: Bereiten Sie sich auf das Zählen vor
es: Prepárate para contar respiraciones
fr: Préparez-vous à compter
hi: Préparez-vous à compter
ja: 呼吸を数える準備
ko: 호흡 측정을 준비하세요
pt: Prepare-se para contar as respirações
ru: Подготовьтесь к счёту вдохов
zh: 准备开始计数

# timeRemainingLabel
source: Time Remaining
ar: الوقت المتبقي
de: Verbleibende Zeit
es: Tiempo restante
fr: Temps restant
hi: Temps restant
ja: 残り時間
ko: 남은 시간
pt: Tempo restante
ru: Оставшееся время
zh: 剩余时间

# breathsCountedLabel
source: Breaths Counted
ar: عدد الأنفاس
de: Gezählte Atemzüge
es: Respiraciones contadas
fr: Respirations comptées
hi: Respirations comptées
ja: カウントされた呼吸
ko: 세어진 호흡 수
pt: Respirações contadas
ru: Подсчитанные вдохи
zh: 已计数的呼吸次数

# startCountingButton
source: Start Counting
ar: ابدأ العد
de: Zählen starten
es: Comenzar conteo
fr: Commencer le comptage
hi: Commencer le comptage
ja: カウント開始
ko: 측정 시작
pt: Iniciar Contagem
ru: Начать счёт
zh: 开始计数

# breathCountResultsTitle
source: Breath Count Results
ar: نتائج عد الأنفاس
de: Ergebnisse der Atemzählung
es: Resultados del Conteo de Respiraciones
fr: Résultats du comptage de respirations
hi: Résultats du comptage de respirations
ja: 呼吸回数の結果
ko: 호흡 수 측정 결과
pt: Resultados da Contagem de Respiração
ru: Результаты подсчёта дыхания
zh: 呼吸计数结果

# breathsPerMinuteLabel
source: Breaths per Minute
ar: أنفاس في الدقيقة
de: Atemzüge pro Minute
es: Respiraciones por minuto
fr: Respirations par minute
hi: Respirations par minute
ja: 1分あたりの呼吸数
ko: 분당 호흡 수
pt: Respirações por minuto
ru: Вдохов в минуту
zh: 每分钟呼吸次数

# breathRateCategoryLabel
source: Breath Rate Category
ar: فئة معدل التنفس
de: Atemfrequenz-Kategorie
es: Categoría de Frecuencia Respiratoria
fr: Catégorie de fréquence respiratoire
hi: Catégorie de fréquence respiratoire
ja: 呼吸速度のカテゴリ
ko: 호흡 속도 카테고리
pt: Categoria de Frequência Respiratória
ru: Категория частоты дыхания
zh: 呼吸速率分类

# breathCountGuidelinesTitle
source: Breath Count Guidelines
ar: إرشادات عد الأنفاس
de: Richtlinien zur Atemzählung
es: Pautas para Contar Respiraciones
fr: Directives pour le comptage de respirations
hi: Directives pour le comptage de respirations
ja: 呼吸回数のガイドライン
ko: 호흡 수 측정 가이드라인
pt: Diretrizes de Contagem de Respirações
ru: Рекомендации по подсчёту дыхания
zh: 呼吸计数指南

# breathCountGuidelinesDescription
source: • Sit or lie down comfortably • Breathe normally • Tap the screen for each breath • Accurate measurement requires calm state
ar: • اجلس أو استلقِ بشكل مريح • تنفس بشكل طبيعي • اضغط على الشاشة عند كل نفس • يتطلب القياس الدقيق حالة هدوء
de: • Setzen oder legen Sie sich bequem hin • Atmen Sie normal • Tippen Sie für jeden Atemzug auf den Bildschirm • Eine genaue Messung erfordert einen ruhigen Zustand
es: • Siéntate o recuéstate cómodamente • Respira normalmente • Toca la pantalla por cada respiración • Se requiere un estado de calma para una medición precisa
fr: • Asseyez-vous ou allongez-vous confortablement • Respirez normalement • Touchez l'écran pour chaque respiration • Une mesure précise nécessite un état de calme
hi: • Asseyez-vous ou allongez-vous confortablement • Respirez normalement • Touchez l'écran pour chaque respiration • Une mesure précise nécessite un état de calme
ja: • 楽な姿勢で座るか横になる • 通常通り呼吸する • 呼吸のたびに画面をタップする • 正確な測定には落ち着いた状態が必要
ko: • 편안하게 앉거나 누우세요 • 정상적으로 호흡하세요 • 숨을 쉴 때마다 화면을 탭하세요 • 정확한 측정을 위해 안정된 상태가 필요합니다
pt: • Sente-se ou deite-se confortavelmente • Respire normalmente • Toque na tela a cada respiração • Para uma medição precisa é preciso estar calmo
ru: • Сядьте или лягте удобно • Дышите нормально • При каждом вдохе нажимайте на экран • Для точного измерения необходимо спокойное состояние
zh: • 舒适地坐下或躺下 • 正常呼吸 • 每次呼吸都点击屏幕 • 准确测量需要保持平静

# invalidInputTitle
source: Invalid Input
ar: إدخال غير صالح
de: Ungültige Eingabe
es: Entrada inválida
fr: Entrée invalide
hi: अमान्य इनपुट
ja: 無効な入力
ko: 잘못된 입력
pt: Entrada inválida
ru: Неверный ввод
zh: 无效输入

# okButtonLabel
source: OK
ar: حسناً
hi: ठीक है
ko: 확인
ru: ОК
zh: 确定

# selectLanguageLabel
source: Select Language
ar: اختر اللغة
de: Sprache wählen
es: Seleccionar idioma
fr: Choisir la langue
hi: भाषा चुनें
ja: 言語を選択
ko: 언어 선택
pt: Selecionar idioma
ru: Выбрать язык
zh: 选择语言

# closeButtonLabel
source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
hi: बंद करें
ja: 閉じる
ko: 닫기
pt: Fechar
ru: Закрыть
zh: 关闭

# defaultSliderLabel
source: Slider Value
ar: قيمة المنزلق
de: Schieberegler-Wert
es: Valor del deslizador
fr: Valeur du curseur
hi: स्लाइडर मूल्य
ja: スライダーの値
ko: 슬라이더 값
pt: Valor do controle deslizante
ru: Значение ползунка
zh: 滑块数值

source: Essential Fat
ar: الدهون الأساسية
de: Essentielle Fette
es: Grasa Esencial
fr: Graisse Essentielle
hi: आवश्यक वसा
ja: 必須脂肪
ko: 필수 지방
pt: Gordura Essencial
ru: Основной жир
zh: 必需脂肪

source: Athletes
ar: الرياضيون
de: Athleten
es: Atletas
fr: Athlètes
hi: एथलीट
ja: アスリート
ko: 운동선수
pt: Atletas
ru: Спортсмены
zh: 运动员

source: Fitness
ar: اللياقة البدنية
es: Aptitud
fr: Forme
hi: फिटनेस
ja: フィットネス
ko: 체력
pt: Aptidão
ru: Фитнес
zh: 健康

source: Acceptable
ar: مقبول
de: Akzeptabel
es: Aceptable
hi: स्वीकृत
ja: 受け入れ可能
ko: 허용 가능한
pt: Aceitável
ru: Приемлемый
zh: 可接受

source: Obese
ar: بدين
de: Fettleibig
es: Obeso
fr: Obèse
hi: मोटा
ja: 肥満
ko: 비만
pt: Obeso
ru: Ожирение
zh: 肥胖

source: Sober
ar: رائق
de: Nüchtern
es: Sobrio
fr: Sobre
hi: साफ
ja: 酔っていない
ko: 맑은
pt: Sóbrios
ru: Трезвый
zh: 清醒

source: Mild Impairment
ar: ضعف خفيف
de: Leichte Beeinträchtigung
es: Deterioro Leve
fr: Légère Altération
hi: हल्का हानि
ja: 軽度の障害
ko: 경미한 손상
pt: Impairment Leve
ru: Легкое нарушение
zh: 轻度损伤

source: Moderate Impairment
ar: ضعف معتدل
de: Mäßige Beeinträchtigung
es: Deterioro Moderado
fr: Altération Modérée
hi: मध्यम हानि
ja: 中程度の障害
ko: 중간 손상
pt: Impairment Moderado
ru: Умеренное нарушение
zh: 中度损伤

source: Significant Impairment
ar: ضعف كبير
de: Bedeutende Beeinträchtigung
es: Deterioro Significativo
fr: Altération Significative
hi: महत्वपूर्ण हानि
ja: 重要な障害
ko: 상당한 손상
pt: Impairment Significativo
ru: Значительное нарушение
zh: 显著损伤

source: Severe Impairment
ar: ضعف شديد
de: Schwere Beeinträchtigung
es: Deterioro Severo
fr: Altération Sévère
hi: गंभीर हानि
ja: 重度の障害
ko: 심각한 손상
pt: Impairment Severo
ru: Тяжелое нарушение
zh: 严重损伤

source: Potentially Fatal
ar: قد يكون قاتلاً
de: Potenziell tödlich
es: Potencialmente Fatal
fr: Potentiellement Mortel
hi: संभावित रूप से घातक
ja: 致命的な可能性がある
ko: 치명적일 수 있음
pt: Potencialmente Fatal
ru: Потенциально смертельный
zh: 可能致命

# lowRisk
source: Low
ar: منخفض
de: Niedrig
es: Bajo
fr: Bas
hi: कम
ja: 低リスク
ko: 낮은
pt: Baixo
ru: Низкий
zh: 低风险

source: Normal
ar: طبيعي
hi: सामान्य
ja: 正常
ko: 정상
ru: Нормальный
zh: 正常

source: High
ar: مرتفع
de: Hoch
es: Alto
fr: Élevé
hi: उच्च
ja: 高い
ko: 높은
pt: Alto
ru: Высокий
zh: 高风险

source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
fr: Inconnu
hi: अज्ञात
ja: 不明
ko: 알 수 없음
pt: Desconhecido
ru: Неизвестно
zh: 未知

# invalidMethod
source: Invalid method. Choose robinson, miller, or devine.
ar: طريقة غير صالحة. اختر روبنسون أو ميلر أو ديفين.
de: Ungültige Methode. Wählen Sie Robinson, Miller oder Devine.
es: Método inválido. Elija robinson, miller o devine.
fr: Méthode invalide. Choisissez robinson, miller ou devine.
hi: अमान्य विधि। रोबिन्सन, मिलर या डेविन चुनें।
ja: 無効な方法。ロビンソン、ミラー、またはデバインを選択してください。
ko: 유효하지 않은 방법. 로빈슨, 밀러 또는 드바인을 선택하십시오.
pt: Método inválido. Escolha robinson, miller ou devine.
ru: Недопустимый метод. Выберите робинсон, миллер или девин.
zh: 无效的方法。选择罗宾逊、米勒或德文。

# invalidBodyFatMethod
source: Invalid body fat calculation method
ar: طريقة حساب الدهون في الجسم غير صالحة
de: Ungültige Methode zur Berechnung des Körperfettanteils
es: Método de cálculo de grasa corporal inválido
fr: Méthode de calcul de la graisse corporelle invalide
hi: अमान्य शरीर वसा गणना विधि
ja: 無効な体脂肪計算方法
ko: 유효하지 않은 체지방 계산 방법
pt: Método de cálculo de gordura corporal inválido
ru: Недопустимый метод расчета жира в организме
zh: 无效的体脂肪计算方法

source: Invalid donation type
ar: نوع التبرع غير صالح
de: Ungültiger Spendentyp
es: Tipo de donación inválido
fr: Type de don de sang invalide
hi: अमान्य दान प्रकार
ja: 無効な寄付タイプ
ko: 유효하지 않은 기부 유형
pt: Tipo de doação inválido
ru: Недопустимый тип донорства
zh: 无效的捐赠类型

source: Unknown Intensity
ar: شدة غير معروفة
de: Unbekannte Intensität
es: Intensidad desconocida
fr: Intensité inconnue
hi: अज्ञात तीव्रता
ja: 不明な強度
ko: 알 수 없는 강도
pt: Intensidade desconhecida
ru: Неизвестная интенсивность
zh: 未知强度

source: Unknown risk
ar: خطر غير معروف
de: Unbekanntes Risiko
es: Riesgo desconocido
fr: Risque inconnu
hi: अज्ञात जोखिम
ja: 不明なリスク
ko: 알 수 없는 위험
pt: Risco desconhecido
ru: Неизвестный риск
zh: 未知风险

# unknownBreathRateCategory
source: Unable to determine breathing rate category.
ar: غير قادر على تحديد فئة معدل التنفس.
de: Kategorie der Atemfrequenz kann nicht bestimmt werden.
es: No se puede determinar la categoría de la tasa de respiración.
fr: Impossible de déterminer la catégorie du taux de respiration.
hi: श्वसन दर श्रेणी निर्धारित नहीं की जा सकती।
ja: 呼吸率カテゴリを特定できません。
ko: 호흡률 범주를 결정할 수 없습니다.
pt: Não foi possível determinar a categoria da taxa de respiração.
ru: Не удалось определить категорию дыхательной частоты.
zh: 无法确定呼吸率类别。

source: Underweight
ar: نقص الوزن
de: Untergewicht
es: Bajo peso
fr: Insuffisance pondérale
hi: कम वजन
ja: 低体重
ko: 저체중
pt: Abaixo do peso
ru: Недостаточный вес
zh: 体重过轻

source: Normal Weight
ar: وزن طبيعي
de: Normales Gewicht
es: Peso normal
fr: Poids normal
hi: सामान्य वजन
ja: 正常体重
ko: 정상 체중
pt: Peso normal
ru: Нормальный вес
zh: 正常体重

source: Overweight
ar: زيادة الوزن
de: Übergewicht
es: Sobrepeso
fr: Surpoids
hi: अधिक वजन
ja: 過体重
ko: 과체중
pt: Sobrepeso
ru: Избыточный вес
zh: 超重

source: Obesity
ar: السمنة
de: Fettleibigkeit
es: Obesidad
fr: Obésité
hi: मोटापा
ja: 肥満
ko: 비만
pt: Obesidade
ru: Ожирение
zh: 肥胖

# weightLoss
source: Lose Weight
ar: فقدان الوزن
de: Gewichtsverlust
es: Perder peso
fr: Perte de poids
hi: वजन कम करें
ja: 体重減少
ko: 체중 감소
pt: Perda de peso
ru: Потеря веса
zh: 减重

# weightGain
source: Gain Weight
ar: زيادة الوزن
de: Gewichtszunahme
es: Ganar peso
fr: Prise de poids
hi: वजन बढ़ाएं
ja: 体重増加
ko: 체중 증가
pt: Ganho de peso
ru: Прибавка в весе
zh: 增重

# maintain
source: Maintain Weight
ar: الحفاظ على الوزن
de: Gewicht halten
es: Mantener peso
fr: Maintenir le poids
hi: वजन बनाए रखें
ja: 体重維持
ko: 체중 유지
pt: Manter peso
ru: Поддерживать вес
zh: 维持体重

source: Resting
ar: راحة
de: Ruhen
es: En reposo
fr: Repos
hi: आराम
ja: 休息
ko: 휴식
pt: Repouso
ru: Отдых
zh: 静息

source: Fat Burning
ar: حرق الدهون
de: Fettverbrennung
es: Quema de grasa
fr: Brûlage des graisses
hi: वसा जलाना
ja: 脂肪燃焼
ko: 지방 연소
pt: Queima de gordura
ru: Сжигание жира
zh: 燃脂

source: Cardio
ar: كارديو
de: Kardio
hi: कार्डियो
ja: カーディオ
ko: 유산소
ru: Кардио
zh: 有氧

source: Peak
ar: ذروة
de: Spitze
es: Pico
fr: Pic
hi: पीक
ja: ピーク
ko: 정점
pt: Pico
ru: Пик
zh: 峰值

source: Maximum
ar: أقصى
de: Maximal
es: Máximo
hi: अधिकतम
ja: 最大
ko: 최대
pt: Máximo
ru: Максимум
zh: 最大值

# invalidDueDateMethod
source: Invalid due date calculation method
ar: طريقة حساب تاريخ الاستحقاق غير صحيحة
de: Ungültige Methode zur Berechnung des Fälligkeitstermins
es: Método de cálculo de fecha de vencimiento no válido
fr: Méthode de calcul de la date d'échéance invalide
hi: अमान्य नियत तारीख की गणना विधि
ja: 無効な出産予定日計算方法
ko: 유효하지 않은 출산 예정일 계산 방법
pt: Método de cálculo da data de vencimento inválido
ru: Недопустимый метод расчета срока
zh: 无效的预产期计算方法

source: First Trimester
ar: الثلاثة أشهر الأولى
de: Erstes Trimester
es: Primer trimestre
fr: Premier trimestre
hi: पहला त्रैमासिक
ja: 第一トリメスター
ko: 첫 번째 삼 분기
pt: Primeiro trimestre
ru: Первый триместр
zh: 第一孕期

source: Second Trimester
ar: الثلاثة أشهر الثانية
de: Zweites Trimester
es: Segundo trimestre
fr: Deuxième trimestre
hi: दूसरा त्रैमासिक
ja: 第二トリメスター
ko: 두 번째 삼 분기
pt: Segundo trimestre
ru: Второй триместр
zh: 第二孕期

source: Third Trimester
ar: الثلاثة أشهر الثالثة
de: Drittes Trimester
es: Tercer trimestre
fr: Troisième trimestre
hi: तीसरा त्रैमासिक
ja: 第三トリメスター
ko: 세 번째 삼 분기
pt: Terceiro trimestre
ru: Третий триместр
zh: 第三孕期

source: Menstrual Phase
ar: مرحلة الحيض
de: Menstruationsphase
es: Fase menstrual
fr: Phase menstruelle
hi: मासिक धर्म चरण
ja: 月経期
ko: 월경 단계
pt: Fase menstrual
ru: Менструальная фаза
zh: 月经期

source: Luteal Phase
ar: المرحلة الأصفرية
es: Fase lútea
fr: Phase lutéale
hi: ल्यूटियल चरण
ja: 黄体期
ko: 황체기
pt: Fase lútea
ru: Лютеиновая фаза
zh: 黄体期

source: Follicular Phase
ar: مرحلة الجريب
de: Follikelphase
es: Fase folicular
fr: Phase folliculaire
hi: फॉलिक्युलर चरण
ja: 卵胞期
ko: 난포기
pt: Fase folicular
ru: Фолликулярная фаза
zh: 卵泡期

source: Ovulation Phase
ar: مرحلة الإباضة
de: Ovulationsphase
es: Fase de ovulación
fr: Phase d'ovulation
hi: अंडोत्सर्ग चरण
ja: 排卵期
ko: 배란기
pt: Fase de ovulação
ru: Овуляторная фаза
zh: 排卵期

# invalidBloodVolumeMethod
source: Invalid blood volume calculation method
ar: طريقة حساب حجم الدم غير صحيحة
de: Ungültige Methode zur Berechnung des Blutvolumens
es: Método de cálculo de volumen sanguíneo no válido
fr: Méthode de calcul du volume sanguin invalide
hi: अमान्य रक्त मात्रा की गणना विधि
ja: 無効な血液量計算方法
ko: 유효하지 않은 혈액량 계산 방법
pt: Método de cálculo do volume sanguíneo inválido
ru: Недопустимый метод расчета объема крови
zh: 无效的血容量计算方法

source: Low
ar: منخفض
de: Niedrig
es: Bajo
fr: Bas
hi: कम
ja: 低い
ko: 낮음
pt: Baixo
ru: Низкий
zh: 低

source: Whole Blood
ar: دم كامل
de: Vollblut
es: Sangre completa
fr: Sang total
hi: पूर्ण रक्त
ja: 全血
ko: 전혈
pt: Sangue total
ru: Целая кровь
zh: 全血

source: Double Red Cells
ar: خلايا حمراء مزدوجة
de: Doppelte rote Blutkörperchen
es: Células rojas dobles
fr: Double cellules rouges
hi: डबल लाल रक्त कोशिकाएं
ja: 二重赤血球
ko: 이중 적혈구
pt: Células vermelhas duplas
ru: Двойные красные клетки
zh: 双红细胞

source: Platelet
ar: صفائح دموية
de: Thrombozyten
es: Plaquetas
fr: Plaquette
hi: प्लेटलेट
ja: 血小板
ko: 혈소판
pt: Plaquetas
ru: Тромбоциты
zh: 血小板

source: Plasma
ar: بلازما
hi: प्लाज्मा
ja: 血漿
ko: 혈장
ru: Плазма
zh: 血浆

source: Unknown Donation Type
ar: نوع التبرع غير معروف
de: Unbekannter Spendentyp
es: Tipo de donación desconocido
fr: Type de don de sang inconnu
hi: अज्ञात दान प्रकार
ja: 不明な寄付タイプ
ko: 알 수 없는 기부 유형
pt: Tipo de doação desconhecido
ru: Неизвестный тип донорства
zh: 未知的捐赠类型
