Repository: ATHIRADI/Seeku-Health-Calculator-Flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, hi, ja, ko, pt, ru, zh

# calculatePregnancyDueDateDescription
source: Calculate your estimated pregnancy due date
ar: احسبي تاريخ الولادة المتوقع
de: Berechnen Sie Ihren geschätzten Entbindungstermin
es: Calcule su fecha estimada de parto
fr: Calculez votre date d'accouchement estimée
hi: अपनी अनुमानित प्रसव तिथि की गणना करें
ja: 推定出産日を計算します
ko: 예상 출산일을 계산하세요
pt: Calcule sua data prevista de parto
ru: Рассчитайте предполагаемую дату родов
zh: 计算您的预计分娩日期

source: First Day of Last Menstrual Period
ar: اليوم الأول من آخر دورة شهرية
de: Erster Tag der letzten Periode
es: Primer día de la última menstruación
fr: Premier jour des dernières règles
hi: पिछली मासिक धर्म का पहला दिन
ja: 最後の月経の初日
ko: 마지막 생리 첫날
pt: Primeiro dia da última menstruação
ru: Первый день последней менструации
zh: 上次月经的第一天

source: Select Date
ar: اختيار التاريخ
de: Datum auswählen
es: Seleccionar Fecha
fr: Sélectionner une Date
hi: तारीख चुनें
ja: 日付を選択
ko: 날짜 선택
pt: Selecionar Data
ru: Выбрать Дату
zh: 选择日期

# naegeleMethod
source: Naegele's Rule (Standard)
ar: قاعدة نايجل (القياسية)
de: Naegele-Regel (Standard)
es: Regla de Naegele (Estándar)
fr: Règle de Naegele (Standard)
hi: नाएगेल नियम (मानक)
ja: ナイゲル法（標準）
ko: 나겔 규칙 (표준)
pt: Regra de Naegele (Padrão)
ru: Правило Найгеля (Стандартный)
zh: 奈格尔法（标准）

# mittendorfMethod
source: Mittendorf Rule
ar: قاعدة ميتندورف
de: Mittendorf-Regel
es: Regla de Mittendorf
fr: Règle de Mittendorf
hi: मिटेंडॉर्फ नियम
ja: ミッテンドルフ法
ko: 미텐도르프 규칙
pt: Regra de Mittendorf
ru: Правило Миттендорфа
zh: 米滕多夫法

# calculateDueDateButton
source: Calculate Due Date
ar: احسبي تاريخ الولادة
de: Entbindungstermin berechnen
es: Calcular Fecha de Parto
fr: Calculer la Date d'Accouchement
hi: प्रसव तिथि की गणना करें
ja: 出産予定日を計算
ko: 출산 예정일 계산
pt: Calcular Data de Parto
ru: Рассчитать Дату Родов
zh: 计算预产期

# pregnancyDueDateResultTitle
source: Pregnancy Due Date Results
ar: نتائج تاريخ الولادة المتوقع
de: Ergebnisse des Entbindungstermins
es: Resultados de Fecha de Parto
fr: Résultats de la Date d'Accouchement
hi: प्रसव तिथि के परिणाम
ja: 出産予定日の結果
ko: 출산 예정일 결과
pt: Resultados da Data de Parto
ru: Результаты Даты Родов
zh: 预产期结果

# estimatedDueDateLabel
source: Estimated Due Date
ar: التاريخ المتوقع للولادة
de: Geschätzter Entbindungstermin
es: Fecha Estimada de Parto
fr: Date d'Accouchement Estimée
hi: अनुमानित प्रसव तिथि
ja: 推定出産日
ko: 예상 출산일
pt: Data Prevista de Parto
ru: Предполагаемая Дата Родов
zh: 预计分娩日期

# gestationalAgeLabel
source: Gestational Age
ar: العمر الحملي
de: Schwangerschaftsalter
es: Edad Gestacional
fr: Âge Gestationnel
hi: गर्भावधि
ja: 妊娠週数
ko: 임신 주수
pt: Idade Gestacional
ru: Срок Беременности
zh: 孕周

# currentTrimesterLabel
source: Current Trimester
ar: الثلث الحالي
de: Aktuelles Trimester
es: Trimestre Actual
fr: Trimestre Actuel
hi: वर्तमान त्रैमासिक
ja: 現在の三半期
ko: 현재 삼분기
pt: Trimestre Atual
ru: Текущий Триместр
zh: 当前孕期

# pregnancyTrimesterInformationTitle
source: Pregnancy Trimester Information
ar: معلومات عن أثلاث الحمل
de: Informationen zu Schwangerschaftstrimestern
es: Información de Trimestres de Embarazo
fr: Informations sur les Trimestres de Grossesse
hi: गर्भावस्था त्रैमासिक जानकारी
ja: 妊娠三半期情報
ko: 임신 삼분기 정보
pt: Informações sobre Trimestres de Gravidez
ru: Информация о Триместрах Беременности
zh: 孕期三个阶段信息

# pregnancyTrimesterInfo
source: • First Trimester: Weeks 1-12 • Second rimester: Weeks 13-26 • Third Trimester: Weeks 27-40
ar: • الثلث الأول: الأسابيع 1-12 • الثلث الثاني: الأسابيع 13-26 • الثلث الثالث: الأسابيع 27-40
de: • Erstes Trimester: Wochen 1-12 • Zweites Trimester: Wochen 13-26 • Drittes Trimester: Wochen 27-40
es: • Primer Trimestre: Semanas 1-12 • Segundo Trimestre: Semanas 13-26 • Tercer Trimestre: Semanas 27-40
fr: • Premier Trimestre : Semaines 1-12 • Deuxième Trimestre : Semaines 13-26 • Troisième Trimestre : Semaines 27-40
hi: • पहला त्रैमासिक: सप्ताह 1-12 • दूसरा त्रैमासिक: सप्ताह 13-26 • तीसरा त्रैमासिक: सप्ताह 27-40
ja: • 第1三半期: 1-12週 • 第2三半期: 13-26週 • 第3三半期: 27-40週
ko: • 제1삼분기: 1-12주 • 제2삼분기: 13-26주 • 제3삼분기: 27-40주
pt: • Primeiro Trimestre: Semanas 1-12 • Segundo Trimestre: Semanas 13-26 • Terceiro Trimestre: Semanas 27-40
ru: • Первый Триместр: Недели 1-12 • Второй Триместр: Недели 13-26 • Третий Триместр: Недели 27-40
zh: • 第一孕期: 1-12周 • 第二孕期: 13-26周 • 第三孕期: 27-40周

# inputErrorPregnancyDate
source: Please select the first day of your last menstrual period.
ar: يرجى اختيار اليوم الأول من آخر دورة شهرية.
de: Bitte wählen Sie den ersten Tag Ihrer letzten Periode.
es: Por favor, seleccione el primer día de su última menstruación.
fr: Veuillez sélectionner le premier jour de vos dernières règles.
hi: कृपया अपनी पिछली मासिक धर्म के पहले दिन का चयन करें।
ja: 最終月経の最初の日を選択してください。
ko: 마지막 생리의 첫날을 선택해 주세요.
pt: Por favor, selecione o primeiro dia da sua última menstruação.
ru: Пожалуйста, выберите первый день последней менструации.
zh: 请选择末次月经的第一天。

source: weeks
ar: أسابيع
de: Wochen
es: semanas
fr: semaines
hi: सप्ताह
ja: 週
ko: 주
pt: semanas
ru: недель
zh: 周

# ovulationPeriodCalculatorTitle
source: Ovulation Period Calculator
ar: حاسبة فترة الإباضة
de: Eisprungrechner
es: Calculadora del Período de Ovulación
fr: Calculateur de Période d'Ovulation
hi: ओव्यूलेशन अवधि कैलकुलेटर
ja: 排卵期間計算機
ko: 배란 기간 계산기
pt: Calculadora de Período de Ovulação
ru: Калькулятор Периода Овуляции
zh: 排卵期计算器

# calculateOvulationDescription
source: Calculate your ovulation and fertile window
ar: احسبي فترة التبويض وفترة الخصوبة لديك
de: Berechnen Sie Ihren Eisprung und Ihr fruchtbares Fenster
es: Calcule su ovulación y su ventana fértil
fr: Calculez votre ovulation et votre fenêtre de fertilité
hi: अपनी ओव्यूलेशन और उर्वर अवधि की गणना करें
ja: 排卵と受精可能期間を計算します
ko: 배란 및 가임 기간을 계산하세요
pt: Calcule sua ovulação e janela fértil
ru: Рассчитайте дату овуляции и период фертильности
zh: 计算您的排卵期和易孕期

# menstrualCycleDurationLabel
source: Menstrual Cycle Duration
ar: مدة الدورة الشهرية
de: Dauer des Menstruationszyklus
es: Duración del ciclo menstrual
fr: Durée du cycle menstruel
hi: मासिक चक्र की अवधि
ja: 生理周期の長さ
ko: 생리 주기 기간
pt: Duração do Ciclo Menstrual
ru: Продолжительность менструального цикла
zh: 月经周期长度

# calculateOvulationButton
source: Calculate Ovulation Period
ar: احسبي فترة الإباضة
de: Eisprung berechnen
es: Calcular Período de Ovulación
fr: Calculer la Période d'Ovulation
hi: ओव्यूलेशन अवधि की गणना करें
ja: 排卵期間を計算
ko: 배란 기간 계산
pt: Calcular Período de Ovulação
ru: Рассчитать период овуляции
zh: 计算排卵期

# ovulationPeriodResultTitle
source: Ovulation Period Results
ar: نتائج فترة الإباضة
de: Ergebnisse des Eisprungs
es: Resultados del Período de Ovulación
fr: Résultats de la Période d'Ovulation
hi: ओव्यूलेशन अवधि के परिणाम
ja: 排卵期間の結果
ko: 배란 기간 결과
pt: Resultados do Período de Ovulação
ru: Результаты периода овуляции
zh: 排卵期结果

# estimatedOvulationDateLabel
source: Estimated Ovulation Date
ar: تاريخ التبويض المتوقع
de: Geschätztes Datum des Eisprungs
es: Fecha Estimada de Ovulación
fr: Date d'Ovulation Estimée
hi: अनुमानित ओव्यूलेशन तिथि
ja: 推定排卵日
ko: 예상 배란일
pt: Data Estimada de Ovulação
ru: Предполагаемая дата овуляции
zh: 预计排卵日期

# fertileWindowLabel
source: Fertile Window
ar: فترة الخصوبة
de: Fruchtbares Fenster
es: Ventana Fértil
fr: Fenêtre de Fertilité
hi: उर्वर अवधि
ja: 受精可能期間
ko: 가임 기간
pt: Janela Fértil
ru: Фертильный период
zh: 易孕期

# menstrualCyclePhasesLabel
source: Menstrual Cycle Phases
ar: مراحل الدورة الشهرية
de: Phasen des Menstruationszyklus
es: Fases del Ciclo Menstrual
fr: Phases du Cycle Menstruel
hi: मासिक चक्र के चरण
ja: 生理周期の段階
ko: 생리 주기의 단계
pt: Fases do Ciclo Menstrual
ru: Фазы менструального цикла
zh: 月经周期阶段

# menstrualCyclePhasesDescription
source: • Menstrual Phase: Days 1-6 • Follicular Phase: Days 7-13 • Ovulation Phase: Days 14-16 • Luteal Phase: Days 17-28
ar: • المرحلة الحيضية: الأيام 1-6 • المرحلة الجريبية: الأيام 7-13 • مرحلة الإباضة: الأيام 14-16 • المرحلة الأصفرية: الأيام 17-28
de: • Menstruationsphase: Tage 1-6 • Follikelphase: Tage 7-13 • Ovulationsphase: Tage 14-16 • Lutealphase: Tage 17-28
es: • Fase Menstrual: Días 1-6 • Fase Folicular: Días 7-13 • Fase de Ovulación: Días 14-16 • Fase Lútea: Días 17-28
fr: • Phase Menstruelle : Jours 1-6 • Phase Folliculaire : Jours 7-13 • Phase d'Ovulation : Jours 14-16 • Phase Lutéale : Jours 17-28
hi: • मासिक धर्म चरण: दिन 1-6 • कूपिल चरण: दिन 7-13 • ओव्यूलेशन चरण: दिन 14-16 • ल्यूटियल चरण: दिन 17-28
ja: • 生理期: 1～6日目 • 卵胞期: 7～13日目 • 排卵期: 14～16日目 • 黄体期: 17～28日目
ko: • 생리 단계: 1~6일 • 여포기: 7~13일 • 배란기: 14~16일 • 황체기: 17~28일
pt: • Fase Menstrual: Dias 1-6 • Fase Folicular: Dias 7-13 • Fase de Ovulação: Dias 14-16 • Fase Lútea: Dias 17-28
ru: • Менструальная фаза: Дни 1-6 • Фолликулярная фаза: Дни 7-13 • Овуляторная фаза: Дни 14-16 • Лютеиновая фаза: Дни 17-28
zh: • 月经期: 第1-6天 • 卵泡期: 第7-13天 • 排卵期: 第14-16天 • 黄体期: 第17-28天

# inputErrorOvulationDate
source: Please select the first day of your last menstrual period.
ar: يرجى اختيار اليوم الأول من آخر دورة شهرية لك.
de: Bitte wählen Sie den ersten Tag Ihrer letzten Periode aus.
es: Por favor, seleccione el primer día de su última menstruación.
fr: Veuillez sélectionner le premier jour de vos dernières règles.
hi: कृपया पिछली मासिक धर्म का पहला दिन चुनें।
ja: 最後の月経の初日を選択してください。
ko: 마지막 생리 첫날을 선택해주세요.
pt: Selecione o primeiro dia da sua última menstruação.
ru: Пожалуйста, выберите первый день последней менструации.
zh: 请选择上次月经的第一天。

# bloodVolumeCalculatorTitle
source: Blood Volume Calculator
ar: حاسبة حجم الدم
de: Blutvolumen-Rechner
es: Calculadora de Volumen Sanguíneo
fr: Calculateur du Volume Sanguin
hi: रक्त आयतन कैलकुलेटर
ja: 血液量計算機
ko: 혈액량 계산기
pt: Calculadora de Volume Sanguíneo
ru: Калькулятор Объема Крови
zh: 血容量计算器

# calculateBloodVolumeDescription
source: Calculate your estimated blood volume
ar: احسب حجم الدم التقديري لديك
de: Berechnen Sie Ihr geschätztes Blutvolumen
es: Calcule su volumen sanguíneo estimado
fr: Calculez votre volume sanguin estimé
hi: अपना अनुमानित रक्त आयतन गणना करें
ja: 推定血液量を計算します
ko: 추정 혈액량을 계산하세요
pt: Calcule seu volume sanguíneo estimado
ru: Рассчитайте примерный объем крови
zh: 计算您的估计血容量

# calculateBloodVolumeButton
source: Calculate Blood Volume
ar: احسب حجم الدم
de: Blutvolumen berechnen
es: Calcular Volumen Sanguíneo
fr: Calculer le Volume Sanguin
hi: रक्त आयतन गणना करें
ja: 血液量を計算
ko: 혈액량 계산
pt: Calcular Volume Sanguíneo
ru: Рассчитать объем крови
zh: 计算血容量

# bloodVolumeResultTitle
source: Blood Volume Results
ar: نتائج حجم الدم
de: Ergebnisse des Blutvolumens
es: Resultados de Volumen Sanguíneo
fr: Résultats du Volume Sanguin
hi: रक्त आयतन परिणाम
ja: 血液量の結果
ko: 혈액량 결과
pt: Resultados do Volume Sanguíneo
ru: Результаты объема крови
zh: 血容量结果

# totalBloodVolumeLabel
source: Total Blood Volume
ar: إجمالي حجم الدم
de: Gesamtes Blutvolumen
es: Volumen Sanguíneo Total
fr: Volume Sanguin Total
hi: कुल रक्त आयतन
ja: 総血液量
ko: 총 혈액량
pt: Volume Sanguíneo Total
ru: Общий объем крови
zh: 总血容量

# bloodVolumeCategoryLabel
source: Blood Volume Category
ar: فئة حجم الدم
de: Blutvolumen-Kategorie
es: Categoría de Volumen Sanguíneo
fr: Catégorie de Volume Sanguin
hi: रक्त आयतन श्रेणी
ja: 血液量のカテゴリー
ko: 혈액량 범주
pt: Categoria de Volume Sanguíneo
ru: Категория объема крови
zh: 血容量类别

# lowRiskThresholdLabel
source: Low Risk Threshold
ar: الحد الأدنى للخطر المنخفض
de: Schwelle für geringes Risiko
es: Umbral de Riesgo Bajo
fr: Seuil de Faible Risque
hi: निम्न जोखिम सीमा
ja: 低リスク閾値
ko: 낮은 위험 기준
pt: Limite de Risco Baixo
ru: Порог низкого риска
zh: 低风险阈值

# highRiskThresholdLabel
source: High Risk Threshold
ar: الحد الأقصى للخطر العالي
de: Schwelle für hohes Risiko
es: Umbral de Riesgo Alto
fr: Seuil de Haut Risque
hi: उच्च जोखिम सीमा
ja: 高リスク閾値
ko: 높은 위험 기준
pt: Limite de Risco Alto
ru: Порог высокого риска
zh: 高风险阈值

# inputErrorBloodVolume
source: Please ensure weight is between 10 and 300 kg.
ar: يرجى التأكد من أن الوزن بين 10 و 300 كجم.
de: Bitte stellen Sie sicher, dass das Gewicht zwischen 10 und 300 kg liegt.
es: Asegúrese de que el peso sea entre 10 y 300 kg.
fr: Veuillez vous assurer que le poids est compris entre 10 et 300 kg.
hi: कृपया सुनिश्चित करें कि वजन 10 से 300 किग्रा के बीच है।
ja: 体重が10～300 kgの範囲内であることを確認してください。
ko: 체중이 10~300 kg 범위인지 확인하세요.
pt: Certifique-se de que o peso esteja entre 10 e 300 kg.
ru: Убедитесь, что вес находится в диапазоне от 10 до 300 кг.
zh: 请确保体重在10到300公斤之间。

source: Standard Method
ar: الطريقة القياسية
de: Standardmethode
es: Método Estándar
fr: Méthode Standard
hi: मानक विधि
ja: 標準方法
ko: 표준 방법
pt: Método Padrão
ru: Стандартный метод
zh: 标准方法

source: Detailed Method
ar: الطريقة التفصيلية
de: Detaillierte Methode
es: Método Detallado
fr: Méthode Détaillée
hi: विस्तृत विधि
ja: 詳細方法
ko: 상세 방법
pt: Método Detalhado
ru: Детальный метод
zh: 详细方法

# bloodVolumeInformationTitle
source: Blood Volume Information
ar: معلومات عن حجم الدم
de: Informationen zum Blutvolumen
es: Información de Volumen Sanguíneo
fr: Informations sur le Volume Sanguin
hi: रक्त आयतन जानकारी
ja: 血液量情報
ko: 혈액량 정보
pt: Informações sobre o Volume Sanguíneo
ru: Информация об объеме крови
zh: 血容量信息

# bloodVolumeInformationDetail
source: • Normal range: 4.5-5.5 liters • Varies based on body weight and gender • Calculated in milliliters (mL)
ar: • المدى الطبيعي: 4.5-5.5 لترات • يختلف حسب وزن الجسم والجنس • يُحسب بالميليلتر (mL)
de: • Normaler Bereich: 4,5-5,5 Liter • Variiert je nach Körpergewicht und Geschlecht • In Millilitern (mL) berechnet
es: • Rango normal: 4.5-5.5 litros • Varía según el peso corporal y el género • Calculado en mililitros (mL)
fr: • Intervalle normal : 4,5 à 5,5 litres • Varie selon le poids corporel et le sexe • Calculé en millilitres (mL)
hi: • सामान्य सीमा: 4.5-5.5 लीटर • शरीर के वजन और लिंग के अनुसार भिन्न होता है • मिलीलीटर (mL) में गणना की जाती है
ja: • 正常範囲: 4.5～5.5リットル • 体重と性別によって異なる • ミリリットル (mL)で計算される
ko: • 정상 범위: 4.5~5.5리터 • 체중과 성별에 따라 다름 • 밀리리터(mL)로 계산됨
pt: • Faixa normal: 4,5 - 5,5 litros • Varia de acordo com o peso corporal e o gênero • Calculado em mililitros (mL)
ru: • Нормальный диапазон: 4,5-5,5 литров • Зависит от массы тела и пола • Рассчитывается в миллилитрах (мл)
zh: • 正常范围：4.5-5.5升 • 取决于体重和性别 • 以毫升(mL)为计算单位

# bloodDonationCalculatorTitle
source: Blood Donation Calculator
ar: حاسبة التبرع بالدم
de: Blutspende-Rechner
es: Calculadora de Donación de Sangre
fr: Calculateur de Don de Sang
hi: रक्तदान कैलकुलेटर
ja: 献血計算機
ko: 헌혈 계산기
pt: Calculadora de Doação de Sangue
ru: Калькулятор Донорства Крови
zh: 献血计算器

# calculateBloodDonationDescription
source: Calculate your next blood donation date
ar: احسب تاريخ التبرع بالدم القادم
de: Berechnen Sie Ihr nächstes Blutspende-Datum
es: Calcule su próxima fecha de donación de sangre
fr: Calculez votre prochaine date de don de sang
hi: अपनी अगली रक्तदान की तारीख की गणना करें
ja: 次の献血日を計算します
ko: 다음 헌혈 날짜를 계산하세요
pt: Calcule sua próxima data de doação de sangue
ru: Рассчитайте дату следующего донорства крови
zh: 计算您的下一个献血日期

# lastDonationDateLabel
source: Last Donation Date
ar: تاريخ آخر تبرع
de: Letzter Spendetag
es: Última Fecha de Donación
fr: Dernière Date de Don
hi: अंतिम रक्तदान की तारीख
ja: 最後の献血日
ko: 마지막 헌혈 날짜
pt: Última Data de Doação
ru: Последняя Дата Донорства
zh: 最后献血日期

# donationTypeLabel
source: Donation Type
ar: نوع التبرع
de: Spendetyp
es: Tipo de Donación
fr: Type de Don
hi: दान का प्रकार
ja: 献血の種類
ko: 헌혈 유형
pt: Tipo de Doação
ru: Тип Донорства
zh: 献血类型

# calculateDonationDetailsButton
source: Calculate Donation Details
ar: احسب تفاصيل التبرع
de: Spende Details berechnen
es: Calcular Detalles de Donación
fr: Calculer les Détails du Don
hi: दान के विवरण की गणना करें
ja: 献血の詳細を計算
ko: 헌혈 세부정보 계산
pt: Calcular Detalhes da Doação
ru: Рассчитать Детали Донорства
zh: 计算献血详情

# bloodDonationResultTitle
source: Blood Donation Results
ar: نتائج التبرع بالدم
de: Blutspende Ergebnisse
es: Resultados de Donación de Sangre
fr: Résultats du Don de Sang
hi: रक्तदान के परिणाम
ja: 献血の結果
ko: 헌혈 결과
pt: Resultados da Doação de Sangue
ru: Результаты Донорства Крови
zh: 献血结果

# nextDonationDateLabel
source: Next Donation Date
ar: تاريخ التبرع القادم
de: Nächstes Spendedatum
es: Próxima Fecha de Donación
fr: Prochaine Date de Don
hi: अगली रक्तदान की तारीख
ja: 次の献血日
ko: 다음 헌혈 날짜
pt: Próxima Data de Doação
ru: Следующая Дата Донорства
zh: 下一个献血日期

# daysUntilNextDonationLabel
source: Days Until Next Donation
ar: الأيام حتى التبرع القادم
de: Tage bis zur nächsten Spende
es: Días Hasta la Próxima Donación
fr: Jours Jusqu'au Prochain Don
hi: अगली रक्तदान तक के दिन
ja: 次の献血までの日数
ko: 다음 헌혈까지의 일수
pt: Dias Até a Próxima Doação
ru: Дни до Следующего Донорства
zh: 距离下一个献血的天数

# eligibilityStatusLabel
source: Eligibility Status
ar: حالة الأهلية
de: Eignungsstatus
es: Estado de Elegibilidad
fr: Statut d'Éligibilité
hi: योग्यता स्थिति
ja: 適格状況
ko: 적격 상태
pt: Status de Elegibilidade
ru: Статус Подходящести
zh: 资格状态

# medicalConditionsLabel
source: Recent Medical Conditions
ar: حالات طبية حديثة
de: Aktuelle medizinische Bedingungen
es: Condiciones Médicas Recientes
fr: Conditions Médicales Récentes
hi: हाल की चिकित्सा स्थितियाँ
ja: 最近の医療状況
ko: 최근 의료 조건
pt: Condições Médicas Recentes
ru: Недавние Медицинские Состояния
zh: 最近的医疗状况

# travelHistoryLabel
source: Recent Travel History
ar: تاريخ سفر حديث
de: Aktuelle Reisehistorie
es: Historial de Viajes Recientes
fr: Historique de Voyage Récent
hi: हाल का यात्रा इतिहास
ja: 最近の旅行歴
ko: 최근 여행 이력
pt: Histórico de Viagens Recentes
ru: Недавняя История Путешествий
zh: 最近的旅行历史

# wholeBloodDonationType
source: Whole Blood
ar: الدم الكامل
de: Vollblut
es: Sangre Completa
fr: Sang Complet
hi: पूर्ण रक्त
ja: 全血
ko: 전혈
pt: Sangue Total
ru: Цельная Кровь
zh: 全血

# doubleRedCellsDonationType
source: Double Red Cells
ar: خلايا الدم الحمراء المضاعفة
de: Doppelte rote Blutkörperchen
es: Células Rojas Dobles
fr: Double Globules Rouges
hi: डबल लाल रक्त कोशिकाएँ
ja: 二重赤血球
ko: 이중 적혈구
pt: Células Vermelhas Duplas
ru: Двойные Красные Кровяные Клетки
zh: 双倍红细胞

# plateletDonationType
source: Platelet
ar: الصفائح الدموية
de: Thrombozyten
es: Plaquetas
fr: Plaquettes
hi: प्लेटलेट
ja: 血小板
ko: 혈소판
pt: Plaquetas
ru: Тромбоциты
zh: 血小板

# plasmaDonationType
source: Plasma
ar: البلازما
hi: प्लाज्मा
ja: 血漿
ko: 혈장
ru: Плазма
zh: 血浆

# eligibleStatus
source: Eligible
ar: مؤهل
de: Berechtigt
es: Elegible
fr: Éligible
hi: योग्य
ja: 適格
ko: 적격
pt: Elegível
ru: Подходящий
zh: 合格

# notEligibleStatus
source: Not Eligible
ar: غير مؤهل
de: Nicht berechtigt
es: No Elegible
fr: Non Éligible
hi: अयोग्य
ja: 不適格
ko: 부적격
pt: Não Elegível
ru: Не Подходящий
zh: 不合格

# inputErrorLastDonationDate
source: Please select your last donation date.
ar: يرجى اختيار تاريخ التبرع الأخير.
de: Bitte wählen Sie Ihr letztes Spendedatum aus.
es: Por favor, seleccione su última fecha de donación.
fr: Veuillez sélectionner votre dernière date de don.
hi: कृपया अपनी अंतिम रक्तदान की तारीख चुनें।
ja: 最後の献血日を選択してください。
ko: 마지막 헌혈 날짜를 선택하세요.
pt: Por favor, selecione sua última data de doação.
ru: Пожалуйста, выберите вашу последнюю дату донорства.
zh: 请选择您的最后献血日期。

# inputErrorGeneral
source: An error occurred. Please check your inputs.
ar: حدث خطأ. يرجى التحقق من المدخلات.
de: Ein Fehler ist aufgetreten. Bitte überprüfen Sie Ihre Eingaben.
es: Ocurrió un error. Por favor, verifique sus entradas.
fr: Une erreur s'est produite. Veuillez vérifier vos entrées.
hi: एक त्रुटि हुई। कृपया अपनी प्रविष्टियों की जांच करें।
ja: エラーが発生しました。入力を確認してください。
ko: 오류가 발생했습니다. 입력을 확인하세요.
pt: Ocorreu um erro. Por favor, verifique suas entradas.
ru: Произошла ошибка. Пожалуйста, проверьте ваши вводимые данные.
zh: 发生错误。请检查您的输入。

source: days
ar: أيام
de: Tage
es: días
fr: jours
hi: दिन
ja: 日
ko: 일
pt: dias
ru: дней
zh: 天

# bacCalculatorTitle
source: BAC Calculator
ar: حاسبة نسبة الكحول في الدم
de: Blutalkoholgehalt-Rechner
es: Calculadora de Contenido de Alcohol en Sangre
fr: Calculateur de Taux d'Alcoolémie
hi: रक्त शराब सामग्री कैलकुलेटर
ja: 血中アルコール濃度計算機
ko: 혈중 알코올 농도 계산기
pt: Calculadora de Teor Alcoólico no Sangue
ru: Калькулятор Содержания Алкоголя в Крови
zh: 血液酒精含量计算器

# calculateBACDescription
source: Calculate your Blood Alcohol Content
ar: احسب محتوى الكحول في دمك
de: Berechnen Sie Ihren Blutalkoholgehalt
es: Calcule su Contenido de Alcohol en Sangre
fr: Calculez votre Taux d'Alcoolémie
hi: अपनी रक्त शराब सामग्री की गणना करें
ja: 血中アルコール濃度を計算する
ko: 혈중 알코올 농도 계산
pt: Calcule seu Teor Alcoólico no Sangue
ru: Рассчитайте Содержание Алкоголя в Крови
zh: 计算您的血液酒精含量

# genderLabel
source: Gender
ar: الجنس
de: Geschlecht
es: Género
fr: Genre
hi: लिंग
ja: 性別
ko: 성별
pt: Gênero
ru: Пол
zh: 性别

# alcoholConsumptionTitle
source: Alcohol Consumption
ar: استهلاك الكحول
de: Alkoholkonsum
es: Consumo de Alcohol
fr: Consommation d'Alcool
hi: शराब का सेवन
ja: アルコール摂取量
ko: 알코올 섭취
pt: Consumo de Álcool
ru: Потребление Алкоголя
zh: 酒精摄入

# drinkTypeLabel
source: Drink Type
ar: نوع المشروب
de: Getränkeart
es: Tipo de Bebida
fr: Type de Boisson
hi: पेय का प्रकार
ja: 飲み物の種類
ko: 음료 종류
pt: Tipo de Bebida
ru: Тип Напитка
zh: 饮料类型

# drinksLabel
source: Drinks
ar: المشروبات
de: Getränke
es: Bebidas
fr: Boissons
hi: पेय
ja: 飲酒量
ko: 음료
pt: Bebidas
ru: Напитки
zh: 饮料数量

# hoursSinceDrinkingLabel
source: Hours Since Drinking
ar: ساعات منذ الشرب
de: Stunden seit dem Trinken
es: Horas desde la Última Bebida
fr: Heures depuis la Dernière Boisson
hi: पिछले पेय के बाद से घंटे
ja: 飲酒からの経過時間
ko: 음주 후 경과 시간
pt: Horas Desde a Última Bebida
ru: Часы с Момента Последнего Приема
zh: 饮酒后经过时间

# calculateBACButton
source: Calculate BAC
ar: احسب نسبة الكحول
de: BAK berechnen
es: Calcular CAS
fr: Calculer le TAC
hi: रक्त शराब सामग्री की गणना करें
ja: 血中アルコール濃度を計算
ko: 혈중 알코올 농도 계산
pt: Calcular TAS
ru: Рассчитать СОК
zh: 计算血液酒精含量

# bacResultTitle
source: Blood Alcohol Content (BAC) Results
ar: نتائج نسبة الكحول في الدم
de: Blutalkoholgehalt-Ergebnisse
es: Resultados de Contenido de Alcohol en Sangre
fr: Résultats du Taux d'Alcoolémie
hi: रक्त शराब सामग्री परिणाम
ja: 血中アルコール濃度結果
ko: 혈중 알코올 농도 결과
pt: Resultados do Teor Alcoólico no Sangue
ru: Результаты Содержания Алкоголя в Крови
zh: 血液酒精含量结果

# bacLevelLabel
source: BAC Level
ar: مستوى الكحول
de: BAK-Niveau
es: Nivel de CAS
fr: Niveau de TAC
hi: रक्त शराब सामग्री स्तर
ja: アルコール濃度レベル
ko: 알코올 농도 수준
pt: Nível de TAS
ru: Уровень СОК
zh: 血液酒精含量水平

# bacCategoryLabel
source: BAC Category
ar: فئة الكحول
de: BAK-Kategorie
es: Categoría de CAS
fr: Catégorie de TAC
hi: रक्त शराब सामग्री श्रेणी
ja: アルコール濃度カテゴリー
ko: 알코올 농도 카테고리
pt: Categoria de TAS
ru: Категория СОК
zh: 血液酒精含量类别

# importantSafetyInfoTitle
source: Important Safety Information
ar: معلومات السلامة المهمة
de: Wichtige Sicherheitsinformationen
es: Información Importante de Seguridad
fr: Informations de Sécurité Importantes
hi: महत्वपूर्ण सुरक्षा जानकारी
ja: 重要な安全情報
ko: 중요한 안전 정보
pt: Informações Importantes de Segurança
ru: Важная Информация о Безопасности
zh: 重要安全信息
