Repository: ATHIRADI/Seeku-Health-Calculator-Flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, hi, ja, ko, pt, ru, zh

# getStartedTitle
source: Get Started with Tracking Your Health!
ar: ابدأ في تتبع صحتك!
de: Beginnen Sie mit der Verfolgung Ihrer Gesundheit!
es: ¡Comienza a seguir tu salud!
fr: Commencez à suivre votre santé !
hi: अपनी सेहत को ट्रैक करना शुरू करें!
ja: 健康管理を始めましょう！
ko: 건강 추적을 시작하세요!
pt: Comece a acompanhar sua saúde!
ru: Начните следить за своим здоровьем!
zh: 开始跟踪您的健康！

# getStartedDescription
source: Calculate your Health and stay on top of your wellness journey, effortlessly.
ar: احسب صحتك وابقَ على اطلاع برحلتك نحو الرفاهية، بكل سهولة.
de: Berechnen Sie Ihre Gesundheit und bleiben Sie mühelos auf Ihrem Wellness-Weg.
es: Calcula tu salud y mantente al tanto de tu viaje de bienestar, sin esfuerzo.
fr: Calculez votre santé et restez au top de votre parcours de bien-être, sans effort.
hi: अपनी सेहत की गणना करें और अपनी कल्याण यात्रा पर आसानी से बने रहें।
ja: 健康を計算し、ウェルネスの旅を楽に追跡しましょう。
ko: 귀하의 건강을 계산하고 웰니스 여정을 쉽게 관리하세요.
pt: Calcule sua saúde e mantenha-se no topo da sua jornada de bem-estar, sem esforço.
ru: Рассчитайте свое здоровье и оставайтесь на вершине своего пути к благополучию без усилий.
zh: 计算您的健康，轻松保持在健康旅程的前沿。

# getStartedButton
source: Get Started
ar: ابدأ
de: Loslegen
es: Comenzar
fr: Commencer
hi: शुरू करें
ja: 始める
ko: 시작하기
pt: Começar
ru: Начать
zh: 开始

source: BMI Calculator
ar: حاسبة مؤشر كتلة الجسم
de: BMI-Rechner
es: Calculadora de IMC
fr: Calculateur d'IMC
hi: बीएमआई कैलकुलेटर
ja: BMI計算機
ko: BMI 계산기
pt: Calculadora de IMC
ru: Калькулятор ИМТ
zh: BMI计算器

source: Ideal Weight
ar: الوزن المثالي
de: Ideales Gewicht
es: Peso Ideal
fr: Poids Idéal
hi: आदर्श वजन
ja: 理想体重
ko: 이상 체중
pt: Peso Ideal
ru: Идеальный Вес
zh: 理想体重

source: Body Fat
ar: نسبة الدهون في الجسم
de: Körperfett
es: Grasa Corporal
fr: Graisse Corporelle
hi: शरीर की चर्बी
ja: 体脂肪
ko: 체지방
pt: Gordura Corporal
ru: Жир в Теле
zh: 体脂

source: Calorie Needs
ar: احتياجات السعرات الحرارية
de: Kalorienbedarf
es: Necesidades Calóricas
fr: Besoins Caloriques
hi: कैलोरी की जरूरतें
ja: カロリー必要量
ko: 칼로리 필요량
pt: Necessidades Calóricas
ru: Калорийные Потребности
zh: 卡路里需求

source: Heart Rate
ar: معدل ضربات القلب
de: Herzfrequenz
es: Frecuencia Cardíaca
fr: Fréquence Cardiaque
hi: दिल की धड़कन
ja: 心拍数
ko: 심박수
pt: Frequência Cardíaca
ru: Частота Сердечных Сокращений
zh: 心率

source: Pregnancy Due Date
ar: تاريخ استحقاق الحمل
de: Entbindungstermin
es: Fecha de Vencimiento del Embarazo
fr: Date d'Accouchement
hi: प्रेग्नेंसी की नियत तारीख
ja: 出産予定日
ko: 임신 예정일
pt: Data Prevista de Parto
ru: Срок Беременности
zh: 怀孕到期日

source: Ovulation Period
ar: فترة الإباضة
de: Eisprungzeitraum
es: Período de Ovulación
fr: Période d'Ovulation
hi: अंडोत्सर्ग अवधि
ja: 排卵期間
ko: 배란 기간
pt: Período de Ovulação
ru: Период Овуляции
zh: 排卵期

source: Blood Volume
ar: حجم الدم
de: Blutvolumen
es: Volumen de Sangre
fr: Volume Sanguin
hi: रक्त मात्रा
ja: 血液量
ko: 혈액량
pt: Volume Sanguíneo
ru: Объем Крови
zh: 血容量

source: Blood Donation
ar: التبرع بالدم
de: Blutspende
es: Donación de Sangre
fr: Don de Sang
hi: रक्तदान
ja: 献血
ko: 헌혈
pt: Doação de Sangue
ru: Пожертвование Крови
zh: 献血

source: Blood Alcohol
ar: الكحول في الدم
de: Blutalkohol
es: Alcohol en Sangre
fr: Alcool dans le Sang
hi: रक्त शराब
ja: 血中アルコール
ko: 혈중 알코올
pt: Álcool no Sangue
ru: Алкоголь в Крови
zh: 血液酒精

source: Blood Pressure
ar: ضغط الدم
de: Blutdruck
es: Presión Arterial
fr: Pression Artérielle
hi: रक्तचाप
ja: 血圧
ko: 혈압
pt: Pressão Arterial
ru: Кровяное Давление
zh: 血压

source: Breath Count
ar: عدد الأنفاس
de: Atemzählung
es: Conteo de Respiración
fr: Nombre de Respirations
hi: श्वास गणना
ja: 呼吸数
ko: 호흡 수
pt: Contagem de Respiração
ru: Количество Вдохов
zh: 呼吸次数

# appBarTitleMain
source: Health Calculators
ar: حاسبات الصحة
de: Gesundheitsrechner
es: Calculadoras de Salud
fr: Calculatrices de Santé
hi: स्वास्थ्य कैलकुलेटर
ja: 健康計算機
ko: 건강 계산기
pt: Calculadoras de Saúde
ru: Калькуляторы Здоровья
zh: 健康计算器

source: Language
ar: اللغة
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
ja: 言語
ko: 언어
pt: Idioma
ru: Язык
zh: 语言

source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzbestimmungen
es: Política de Privacidad
fr: Politique de Confidentialité
hi: गोपनीयता नीति
ja: プライバシーポリシー
ko: 개인정보 처리방침
pt: Política de Privacidade
ru: Политика Конфиденциальности
zh: 隐私政策

source: Share
ar: مشاركة
de: Teilen
es: Compartir
fr: Partager
hi: शेयर करें
ja: 共有
ko: 공유
pt: Compartilhar
ru: Поделиться
zh: 分享

source: Rate Us
ar: قيمنا
de: Bewerten Sie uns
es: Califícanos
fr: Évaluez-nous
hi: हमें रेट करें
ja: 評価してください
ko: 평가하기
pt: Avalie-nos
ru: Оцените нас
zh: 给我们评分

source: Feedback
ar: ملاحظات
de: Rückmeldung
es: Comentarios
fr: Retour d'information
hi: फीडबैक
ja: フィードバック
ko: 피드백
ru: Обратная связь
zh: 反馈

# appBarTitleBMI
source: BMI Calculator
ar: حاسبة مؤشر كتلة الجسم
de: BMI-Rechner
es: Calculadora de IMC
fr: Calculateur d'IMC
hi: बीएमआई कैलकुलेटर
ja: BMI計算機
ko: BMI 계산기
pt: Calculadora de IMC
ru: Калькулятор ИМТ
zh: BMI计算器

# calculateBMIDescription
source: Calculate your BMI to determine the right weight for your height
ar: احسب مؤشر كتلة الجسم الخاص بك لتحديد الوزن المناسب لطولك
de: Berechnen Sie Ihren BMI, um das richtige Gewicht für Ihre Größe zu bestimmen
es: Calcule su IMC para determinar el peso adecuado para su altura
fr: Calculez votre IMC pour déterminer le poids idéal pour votre taille
hi: अपने ऊँचाई के लिए सही वजन निर्धारित करने के लिए अपना बीएमआई कैलकुलेट करें
ja: 身長に対して適切な体重を決定するためにBMIを計算します
ko: 신장에 맞는 적절한 체중을 결정하기 위해 BMI를 계산하세요.
pt: Calcule seu IMC para determinar o peso ideal para sua altura
ru: Рассчитайте свой ИМТ, чтобы определить правильный вес для вашего роста
zh: 计算您的BMI以确定适合您身高的体重

# weightLabel
source: Weight (kg)
ar: الوزن (كجم)
de: Gewicht (kg)
es: Peso (kg)
fr: Poids (kg)
hi: वजन (किग्रा)
ja: 体重 (kg)
ko: 체중 (kg)
pt: Peso (kg)
ru: Вес (кг)
zh: 体重 (公斤)

# ageLabel
source: Age (years)
ar: العمر (سنوات)
de: Alter (Jahre)
es: Edad (años)
fr: Âge (années)
hi: उम्र (वर्ष)
ja: 年齢（歳）
ko: 나이 (세)
pt: Idade (anos)
ru: Возраст (лет)
zh: 年龄（岁）

# heightLabel
source: Height (cm)
ar: الطول (سم)
de: Höhe (cm)
es: Altura (cm)
fr: Hauteur (cm)
hi: ऊंचाई (सेमी)
ja: 身長 (cm)
ko: 키 (cm)
pt: Altura (cm)
ru: Рост (см)
zh: 身高 (厘米)

# calculateButtonText
source: Calculate Body Fat
ar: احسب نسبة الدهون في الجسم
de: Körperfett berechnen
es: Calcular Grasa Corporal
fr: Calculer la Graisse Corporelle
hi: शरीर की चर्बी की गणना करें
ja: 体脂肪を計算する
ko: 체지방 계산하기
pt: Calcular Gordura Corporal
ru: Рассчитать Жир в Теле
zh: 计算体脂

# resultDialogTitle
source: Your BMI Result
ar: نتيجة مؤشر كتلة الجسم الخاصة بك
de: Ihr BMI-Ergebnis
es: Su Resultado de IMC
fr: Votre Résultat d'IMC
hi: आपका बीएमआई परिणाम
ja: あなたのBMI結果
ko: 당신의 BMI 결과
pt: Seu Resultado de IMC
ru: Ваш результат ИМТ
zh: 您的BMI结果

source: Healthy Weight Range
ar: نطاق الوزن الصحي
de: Gesunder Gewichtsbereich
es: Rango de Peso Saludable
fr: Plage de Poids Sain
hi: स्वस्थ वजन सीमा
ja: 健康的な体重範囲
ko: 건강한 체중 범위
pt: Faixa de Peso Saudável
ru: Здоровый диапазон веса
zh: 健康体重范围

# inputErrorMessage
source: Please ensure all inputs are valid.
ar: يرجى التأكد من صحة جميع المدخلات.
de: Bitte stellen Sie sicher, dass alle Eingaben gültig sind.
es: Asegúrese de que todas las entradas sean válidas.
fr: Veuillez vous assurer que toutes les entrées sont valides.
hi: कृपया सुनिश्चित करें कि सभी इनपुट वैध हैं।
ja: すべての入力が有効であることを確認してください。
ko: 모든 입력값이 유효한지 확인하세요.
pt: Certifique-se de que todas as entradas são válidas.
ru: Убедитесь, что все входные данные корректны.
zh: 请确保所有输入有效。

source: BMI Score
ar: نتيجة مؤشر كتلة الجسم
de: BMI-Wert
es: Puntuación de IMC
fr: Score IMC
hi: बीएमआई स्कोर
ja: BMIスコア
ko: BMI 점수
pt: Pontuação de IMC
ru: ИМТ
zh: BMI评分

source: Gender
ar: الجنس
de: Geschlecht
es: Género
fr: Genre
hi: लिंग
ja: 性別
ko: 성별
pt: Gênero
ru: Пол
zh: 性别

source: Male
ar: ذكر
de: Männlich
es: Masculino
fr: Homme
hi: पुरुष
ja: 男性
ko: 남성
pt: Masculino
ru: Мужчина
zh: 男性

source: Female
ar: أنثى
de: Weiblich
es: Femenino
fr: Femme
hi: महिला
ja: 女性
ko: 여성
pt: Feminino
ru: Женщина
zh: 女性

# appBarTitleIdealWeight
source: Ideal Weight Calculator
ar: حاسبة الوزن المثالي
de: BMI-Rechner
fr: Calculateur de Poids Idéal
hi: आदर्श वजन कैलकुलेटर
ja: 理想体重計算機
ko: 이상 체중 계산기
pt: Calculadora de Peso Ideal
ru: Калькулятор Идеального Веса
zh: 理想体重计算器

# calculateIdealWeightDescription
source: Calculate your ideal body weight based on height and gender
ar: احسب وزنك المثالي بناءً على الطول والجنس
de: Berechnen Sie Ihr ideales Körpergewicht basierend auf Größe und Geschlecht
fr: Calculez votre poids corporel idéal en fonction de votre taille et de votre sexe
hi: ऊँचाई और लिंग के आधार पर आपके आदर्श शरीर के वजन की गणना करें
ja: 身長と性別に基づいて理想的な体重を計算します
ko: 신장과 성별에 따라 이상적인 체중을 계산합니다
pt: Calcule seu peso corporal ideal com base na altura e no gênero
ru: Рассчитайте свой идеальный вес в зависимости от роста и пола
zh: 根据身高和性别计算您的理想体重

# calculationMethodLabel
source: Calculation Method
ar: طريقة الحساب
de: Berechnungsmethode
es: Método de Cálculo
fr: Méthode de Calcul
hi: गणना विधि
ja: 計算方法
ko: 계산 방법
pt: Método de Cálculo
ru: Метод расчета
zh: 计算方法

source: Robinson Method
ar: طريقة روبنسون
de: Robinson-Methode
fr: Méthode Robinson
hi: रोबिन्सन विधि
ja: ロビンソン法
ko: 로빈슨 법
pt: Método Robinson
ru: Метод Робинсона
zh: 罗宾逊法

source: Miller Method
ar: طريقة ميلر
de: Miller-Methode
fr: Méthode Miller
hi: मिलर विधि
ja: ミラー法
ko: 밀러 법
pt: Método Miller
ru: Метод Миллера
zh: 米勒法

source: Devine Method
ar: طريقة ديفين
de: Devine-Methode
fr: Méthode Devine
hi: डेवीन विधि
ja: デビン法
ko: 드바인 법
pt: Método Devine
ru: Метод ДеВина
zh: 德维纳法

# appBarTitleBodyFat
source: Body Fat Calculator
ar: حاسبة الدهون في الجسم
de: Körperfett Rechner
es: Calculadora de Grasa Corporal
fr: Calculateur de Graisse Corporelle
hi: शरीर की चर्बी कैलकुलेटर
ja: 体脂肪計算機
ko: 체지방 계산기
pt: Calculadora de Gordura Corporal
ru: Калькулятор Жира в Теле
zh: 体脂计算器

# calculateBodyFatDescription
source: Measure your body fat percentage
ar: قم بقياس نسبة الدهون في جسمك
de: Messen Sie Ihren Körperfettanteil
es: Mida su porcentaje de grasa corporal
fr: Mesurez votre pourcentage de graisse corporelle
hi: अपने शरीर की चर्बी का प्रतिशत मापें
ja: 体脂肪率を測定します
ko: 체지방 비율을 측정합니다
pt: Meça sua porcentagem de gordura corporal
ru: Измерьте свой процент жира в теле
zh: 测量您的体脂百分比

# waistCircumferenceLabel
source: Waist Circumference (cm)
ar: محيط الخصر (سم)
de: Taillenumfang (cm)
es: Circunferencia de la Cintura (cm)
fr: Circonférence de la Taille (cm)
hi: कमर की परिधि (सेमी)
ja: ウエスト周囲 (cm)
ko: 허리 둘레 (cm)
pt: Circunferência da Cintura (cm)
ru: Объем Талии (см)
zh: 腰围 (cm)

# neckCircumferenceLabel
source: Neck Circumference (cm)
ar: محيط العنق (سم)
de: Halsumfang (cm)
es: Circunferencia del Cuello (cm)
fr: Circonférence du Cou (cm)
hi: गर्दन की परिधि (सेमी)
ja: 首周囲 (cm)
ko: 목 둘레 (cm)
pt: Circunferência do Pescoço (cm)
ru: Объем Шеи (см)
zh: 颈围 (cm)

# hipCircumferenceLabel
source: Hip Circumference (cm)
ar: محيط الورك (سم)
de: Hüftumfang (cm)
es: Circunferencia de la Cadera (cm)
fr: Circonférence des Hanches (cm)
hi: कूल्हे की परिधि (सेमी)
ja: ヒップ周囲 (cm)
ko: 엉덩이 둘레 (cm)
pt: Circunferência do Quadril (cm)
ru: Объем Бедер (см)
zh: 臀围 (cm)

source: Measurement Required
ar: المقاس مطلوب
de: Messung erforderlich
es: Medición Requerida
fr: Mesure Requise
hi: माप आवश्यक है
ja: 測定が必要です
ko: 측정이 필요합니다
pt: Medida Necessária
ru: Требуется Измерение
zh: 需要测量

# measurementError
source: For US Navy method, please provide: - Waist Circumference - Neck Circumference - Hip Circumference
ar: بالنسبة لطريقة البحرية الأمريكية، يرجى تقديم: - محيط الخصر - محيط العنق - محيط الورك
de: Bitte geben Sie für die US Navy-Methode an: - Taillenumfang - Halsumfang - Hüftumfang
es: Para el método de la Marina de EE. UU., proporcione: - Circunferencia de la Cintura - Circunferencia del Cuello - Circunferencia de la Cadera
fr: Pour la méthode de la Marine américaine, veuillez fournir : - Circonférence de la Taille - Circonférence du Cou - Circonférence des Hanches
hi: यूएस नेवी विधि के लिए, कृपया प्रदान करें: - कमर की परिधि - गर्दन की परिधि - कूल्हे की परिधि
ja: 米海軍方式の場合は、次の情報を提供してください： - ウエスト周囲 - 首周囲 - ヒップ周囲
ko: 미국 해군 방법의 경우는 다음을 제공하십시오: - 허리 둘레 - 목 둘레 - 엉덩이 둘레
pt: Para o método da Marinha dos EUA, forneça: - Circunferência da Cintura - Circunferência do Pescoço - Circunferência do Quadril
ru: Для метода Военно-морского флота США, пожалуйста, предоставьте: - Объем Талии - Объем Шеи - Объем Бедер
zh: 对于美国海军方法，请提供： - 腰围 - 颈围 - 臀围

source: Body Fat Percentage
ar: نسبة الدهون في الجسم
de: Körperfettanteil
es: Porcentaje de Grasa Corporal
fr: Pourcentage de Graisse Corporelle
hi: शरीर की चर्बी का प्रतिशत
ja: 体脂肪率
ko: 체지방 비율
pt: Porcentagem de Gordura Corporal
ru: Процент Жира в Теле
zh: 体脂百分比

source: Body Fat Category
ar: فئة الدهون في الجسم
de: Körperfettkategorie
es: Categoría de Grasa Corporal
fr: Catégorie de Graisse Corporelle
hi: शरीर की चर्बी की श्रेणी
ja: 体脂肪カテゴリー
ko: 체지방 카테고리
pt: Categoria de Gordura Corporal
ru: Категория Жира в Теле
zh: 体脂类别

# bmiMethod
source: BMI-Based Method
ar: طريقة قائمة على BMI
de: BMI-basierte Methode
es: Método Basado en IMC
fr: Méthode Basée sur l'IMC
hi: BMI आधारित विधि
ja: BMIベースの方法
ko: BMI 기반 방법
pt: Método Baseado em IMC
ru: Метод на Основе ИМТ
zh: 基于BMI的方法

source: US Navy Method
ar: طريقة البحرية الأمريكية
de: US Navy-Methode
es: Método de la Marina de EE. UU.
fr: Méthode de la Marine Américaine
hi: यूएस नेवी विधि
ja: 米海軍方式
ko: 미국 해군 방법
pt: Método da Marinha dos EUA
ru: Метод Военно-Морского Флота США
zh: 美国海军方法

source: Jackson-Pollock Method
ar: طريقة جاكسون-بولك
de: Jackson-Pollock-Methode
es: Método Jackson-Pollock
fr: Méthode Jackson-Pollock
hi: जैक्सन-पोलक विधि
ja: ジャクソン・ポロック方式
ko: 잭슨-폴락 방법
pt: Método Jackson-Pollock
ru: Метод Джексона-Поллока
zh: 杰克逊-波洛克方法

# caloriesCalculatorTitle
source: Calories Calculator
ar: حاسبة السعرات الحرارية
de: Kalorienrechner
es: Calculadora de Calorías
fr: Calculateur de Calories
hi: कैलोरी कैलकुलेटर
ja: カロリー計算機
ko: 칼로리 계산기
pt: Calculadora de Calorias
ru: Калькулятор Калорий
zh: 卡路里计算器

# caloriesCalculatorDescription
source: Calculate your daily calorie needs
ar: احسب احتياجاتك اليومية من السعرات الحرارية
de: Berechnen Sie Ihren täglichen Kalorienbedarf
es: Calcule sus necesidades diarias de calorías
fr: Calculez vos besoins quotidiens en calories
hi: अपनी दैनिक कैलोरी आवश्यकताओं की गणना करें
ja: 1日のカロリー必要量を計算します
ko: 일일 칼로리 필요량을 계산하세요
pt: Calcule suas necessidades diárias de calorias
ru: Рассчитайте свою суточную потребность в калориях
zh: 计算您的每日卡路里需求

# weightGoalLabel
source: Weight Goal
ar: هدف الوزن
de: Gewichtsziel
es: Objetivo de Peso
fr: Objectif de Poids
hi: वजन का लक्ष्य
ja: 体重目標
ko: 체중 목표
pt: Objetivo de Peso
ru: Цель по Весу
zh: 体重目标

# activityLevelLabel
source: Activity Level
ar: مستوى النشاط
de: Aktivitätsniveau
es: Nivel de Actividad
fr: Niveau d'Activité
hi: गतिविधि का स्तर
ja: 活動レベル
ko: 활동 수준
pt: Nível de Atividade
ru: Уровень Активности
zh: 活动水平

# calculateCaloriesButton
source: Calculate Calories
ar: احسب السعرات الحرارية
de: Kalorien berechnen
es: Calcular Calorías
fr: Calculer les Calories
hi: कैलोरी की गणना करें
ja: カロリーを計算
ko: 칼로리 계산
pt: Calcular Calorias
ru: Рассчитать Калории
zh: 计算卡路里

# caloriesResultTitle
source: Your Calorie Needs
ar: احتياجاتك من السعرات الحرارية
de: Ihr Kalorienbedarf
es: Sus Necesidades de Calorías
fr: Vos Besoins en Calories
hi: आपकी कैलोरी आवश्यकताएं
ja: あなたのカロリー必要量
ko: 귀하의 칼로리 필요량
pt: Suas Necessidades de Calorias
ru: Ваша Потребность в Калориях
zh: 您的卡路里需求

# caloriesResultLabel
source: Calories Needed
ar: السعرات الحرارية المطلوبة
de: Benötigte Kalorien
es: Calorías Necesarias
fr: Calories Nécessaires
hi: आवश्यक कैलोरी
ja: 必要カロリー
ko: 필요 칼로리
pt: Calorias Necessárias
ru: Необходимые Калории
zh: 所需卡路里

# caloriesPerDay
source: Calories/Day
ar: سعرة حرارية/يوم
de: Kalorien/Tag
es: Calorías/Día
fr: Calories/Jour
hi: कैलोरी/दिन
ja: カロリー/日
ko: 칼로리/일
pt: Calorias/Dia
ru: Калорий/День
zh: 卡路里/天

# weightGoalMaintain
source: Maintain Weight
ar: الحفاظ على الوزن
de: Gewicht halten
es: Mantener Peso
fr: Maintenir le Poids
hi: वजन बनाए रखें
ja: 体重維持
ko: 체중 유지
pt: Manter Peso
ru: Сохранить Вес
zh: 维持体重

# weightGoalLose
source: Lose Weight
ar: فقدان الوزن
de: Gewicht verlieren
es: Perder Peso
fr: Perdre du Poids
hi: वजन कम करें
ja: 減量
ko: 체중 감량
pt: Perder Peso
ru: Похудеть
zh: 减重

# weightGoalGain
source: Gain Weight
ar: زيادة الوزن
de: Gewicht zunehmen
es: Ganar Peso
fr: Prendre du Poids
hi: वजन बढ़ाएं
ja: 増量
ko: 체중 증가
pt: Ganhar Peso
ru: Набрать Вес
zh: 增重

# activityLevelSedentary
source: Sedentary (Little/No Exercise)
ar: خامل (بدون تمارين)
de: Sitzend (Keine/Wenig Bewegung)
es: Sedentario (Sin/Poco Ejercicio)
fr: Sédentaire (Peu/Pas d'Exercice)
hi: निष्क्रिय (कोई/बहुत कम व्यायाम)
ja: 座りがち（運動なし/ほとんどなし）
ko: 비활동적 (운동 없음/거의 없음)
pt: Sedentário (Pouco/Nenhum Exercício)
ru: Сидячий (Без/Мало Упражнений)
zh: 久坐（无/很少运动）

# activityLevelLightlyActive
source: Lightly Active (1-3 days/week)
ar: نشيط قليلاً (1-3 أيام/أسبوع)
de: Leicht aktiv (1-3 Tage/Woche)
es: Ligeramente Activo (1-3 días/semana)
fr: Légèrement Actif (1-3 jours/semaine)
hi: हल्का सक्रिय (1-3 दिन/सप्ताह)
ja: 軽い活動（週1-3日）
ko: 약간 활동적 (주 1-3일)
pt: Levemente Ativo (1-3 dias/semana)
ru: Легкая Активность (1-3 дня/неделя)
zh: 轻度活动（每周1-3天）

# activityLevelModeratelyActive
source: Moderately Active (3-5 days/week)
ar: نشيط بشكل معتدل (3-5 أيام/أسبوع)
de: Mäßig aktiv (3-5 Tage/Woche)
es: Moderadamente Activo (3-5 días/semana)
fr: Modérément Actif (3-5 jours/semaine)
hi: मध्यम रूप से सक्रिय (3-5 दिन/सप्ताह)
ja: 中程度の活動（週3-5日）
ko: 중간 정도로 활동적 (주 3-5일)
pt: Moderadamente Ativo (3-5 dias/semana)
ru: Умеренная Активность (3-5 дней/неделя)
zh: 中度活动（每周3-5天）

# activityLevelVeryActive
source: Very Active (6-7 days/week)
ar: نشيط جداً (6-7 أيام/أسبوع)
de: Sehr aktiv (6-7 Tage/Woche)
es: Muy Activo (6-7 días/semana)
fr: Très Actif (6-7 jours/semaine)
hi: बहुत सक्रिय (6-7 दिन/सप्ताह)
ja: 非常に活動的（週6-7日）
ko: 매우 활동적 (주 6-7일)
pt: Muito Ativo (6-7 dias/semana)
ru: Очень Активный (6-7 дней/неделя)
zh: 非常活跃（每周6-7天）

# activityLevelExtraActive
source: Extra Active (Hard Exercise Daily)
ar: نشيط للغاية (تمارين يومية مكثفة)
de: Extra aktiv (Tägliches hartes Training)
es: Extra Activo (Ejercicio Intenso Diario)
fr: Extra Actif (Exercice Intense Quotidien)
hi: अतिरिक्त सक्रिय (दैनिक कठोर व्यायाम)
ja: 超活動的（毎日激しい運動）
ko: 초활동적 (매일 강도 높은 운동)
pt: Extra Ativo (Exercício Intenso Diário)
ru: Экстра Активный (Ежедневные Интенсивные Упражнения)
zh: 超级活跃（每天高强度运动）

# heartRateCalculatorTitle
source: Heart Rate Calculator
ar: حاسبة معدل ضربات القلب
de: Herzfrequenzrechner
es: Calculadora de Frecuencia Cardíaca
fr: Calculateur de Fréquence Cardiaque
hi: हृदय गति कैलकुलेटर
ja: 心拍数計算機
ko: 심박수 계산기
pt: Calculadora de Frequência Cardíaca
ru: Калькулятор Частоты Сердечных Сокращений
zh: 心率计算器

# heartRateCalculatorDescription
source: Calculate your heart rate training zones
ar: احسب مناطق التدريب لمعدل ضربات القلب
de: Berechnen Sie Ihre Herzfrequenzzonen
es: Calcule sus zonas de entrenamiento de frecuencia cardíaca
fr: Calculez vos zones d'entraînement de fréquence cardiaque
hi: अपने हृदय गति प्रशिक्षण क्षेत्रों की गणना करें
ja: 心拍数トレーニングゾーンを計算します
ko: 심박수 훈련 구간을 계산하세요
pt: Calcule suas zonas de treinamento de frequência cardíaca
ru: Рассчитайте зоны тренировок по частоте сердечных сокращений
zh: 计算您的心率训练区间

# calculateHeartRateButton
source: Calculate Heart Rate Zones
ar: احسب مناطق معدل ضربات القلب
de: Herzfrequenzzonen berechnen
es: Calcular Zonas de Frecuencia Cardíaca
fr: Calculer les Zones de Fréquence Cardiaque
hi: हृदय गति क्षेत्र गणना करें
ja: 心拍数ゾーンを計算
ko: 심박수 구간 계산
pt: Calcular Zonas de Frequência Cardíaca
ru: Рассчитать Зоны Частоты Сердечных Сокращений
zh: 计算心率区间

# heartRateResultTitle
source: Your Heart Rate Zones
ar: مناطق معدل ضربات القلب الخاصة بك
de: Ihre Herzfrequenzzonen
es: Sus Zonas de Frecuencia Cardíaca
fr: Vos Zones de Fréquence Cardiaque
hi: आपके हृदय गति क्षेत्र
ja: あなたの心拍数ゾーン
ko: 귀하의 심박수 구간
pt: Suas Zonas de Frequência Cardíaca
ru: Ваши Зоны Частоты Сердечных Сокращений
zh: 您的心率区间

# maxHeartRateLabel
source: Max Heart Rate
ar: الحد الأقصى لمعدل ضربات القلب
de: Maximale Herzfrequenz
es: Frecuencia Cardíaca Máxima
fr: Fréquence Cardiaque Maximale
hi: अधिकतम हृदय गति
ja: 最大心拍数
ko: 최대 심박수
pt: Frequência Cardíaca Máxima
ru: Максимальная Частота Сердечных Сокращений
zh: 最大心率

# heartRateZonesInfo
source: • Resting: Light warm-up and cool-down • Fat Burning: Moderate, steady-state cardio • Cardio: Improved cardiovascular fitness • Peak: High-intensity interval training • Maximum: Short, intense bursts of activity
ar: • الراحة: الإحماء الخفيف والتهدئة • حرق الدهون: التمارين المعتدلة والمستمرة • القلب والأوعية الدموية: تحسين اللياقة القلبية الوعائية • الذروة: التدريب عالي الكثافة • الحد الأقصى: نبضات قصيرة وشديدة
de: • Ruhe: Leichte Erwärmung und Abkühlung • Fettverbrennung: Moderate, gleichmäßige Kardio • Herz-Kreislauf: Verbesserte kardiovaskuläre Fitness • Spitze: Hochintensives Intervalltraining • Maximum: Kurze, intensive Aktivitäten
es: • Reposo: Calentamiento y enfriamiento ligero • Quema de Grasa: Cardio moderado y constante • Cardiovascular: Mejora de la aptitud cardiovascular • Pico: Entrenamiento de intervalos de alta intensidad • Máximo: Ráfagas cortas e intensas de actividad
fr: • Repos : Échauffement et récupération légers • Brûlage des Graisses : Cardio modéré et régulier • Cardiovasculaire : Amélioration de la condition cardiovasculaire • Pic : Entraînement par intervalles à haute intensité • Maximum : Courtes bouffées d'activité intense
hi: • आराम: हल्का वार्म-अप और शांत करना • वसा जलाना: मध्यम, स्थिर कार्डियो • कार्डियोवैस्कुलर: बेहतर हृदय स्वास्थ्य • शीर्ष: उच्च तीव्रता वाला अंतराल प्रशिक्षण • अधिकतम: संक्षिप्त, तीव्र गतिविधि
ja: • 安静: 軽いウォームアップとクールダウン • 脂肪燃焼: 中程度の定常状態の有酸素運動 • 心血管: 心血管系フィットネスの向上 • ピーク: 高強度インターバルトレーニング • 最大: 短く、激しい活動
ko: • 휴식: 가벼운 워밍업과 쿨다운 • 지방 연소: 중간 강도의 지속적인 유산소 운동 • 심혈관: 심혈관 체력 향상 • 최고점: 고강도 인터벌 트레이닝 • 최대: 짧고 강렬한 활동
pt: • Repouso: Aquecimento e esfriamento leve • Queima de Gordura: Cardio moderado e constante • Cardiovascular: Melhoria do condicionamento cardiovascular • Pico: Treinamento de intervalo de alta intensidade • Máximo: Rajadas curtas e intensas de atividade
ru: • Покой: Легкая разминка и охлаждение • Сжигание Жира: Умеренный, стабильный кардио • Сердечно-Сосудистая: Улучшение сердечно-сосудистой подготовки • Пик: Высокоинтенсивный интервальный тренинг • Максимум: Короткие, интенсивные всплески активности
zh: • 休息: 轻度热身和冷却 • 燃脂: 中等强度稳定有氧 • 心血管: 改善心血管健康 • 峰值: 高强度间歇训练 • 最大: 短暂、强烈的活动

# traditionalMethod
source: Traditional (220 - Age)
ar: التقليدية (220 - العمر)
de: Traditionell (220 - Alter)
es: Tradicional (220 - Edad)
fr: Traditionnelle (220 - Âge)
hi: पारंपरिक (220 - उम्र)
ja: 従来法 (220 - 年齢)
ko: 전통적 방법 (220 - 나이)
pt: Tradicional (220 - Idade)
ru: Традиционный (220 - Возраст)
zh: 传统方法 (220 - 年龄)

# heartRateZoneInformationTitle
source: Heart Rate Zone Information
ar: معلومات عن مناطق معدل ضربات القلب
de: Informationen zu Herzfrequenzzonen
es: Información de Zonas de Frecuencia Cardíaca
fr: Informations sur les Zones de Fréquence Cardiaque
hi: हृदय गति क्षेत्र जानकारी
ja: 心拍数ゾーン情報
ko: 심박수 구간 정보
pt: Informações de Zonas de Frequência Cardíaca
ru: Информация о Зонах Частоты Сердечных Сокращений
zh: 心率区间信息

# pregnancyDueDateCalculatorTitle
source: Pregnancy Due Date Calculator
ar: حاسبة تاريخ الولادة المتوقع
de: Schwangerschafts-Entbindungstermin-Rechner
es: Calculadora de Fecha de Parto
fr: Calculateur de Date d'Accouchement
hi: गर्भावस्था प्रसव तिथि कैलकुलेटर
ja: 出産予定日計算機
ko: 출산 예정일 계산기
pt: Calculadora de Data Prevista de Parto
ru: Калькулятор Даты Родов
zh: 预产期计算器
