Repository: ATHIRADI/Seeku-Health-Calculator-Flutter
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, hi, ja, ko, pt, ru, zh

# slightMoodChanges
source: Slight mood changes, relaxation
ar: تغيرات طفيفة في المزاج، استرخاء
de: Leichte Stimmungsschwankungen, Entspannung
es: Cambios de humor ligeros, relajación
fr: Légers changements d'humeur, détente
hi: हल्के मूड में बदलाव, विश्राम
ja: 軽い気分の変化、リラックス
ko: 약간의 기분 변화, 이완
pt: Mudanças de humor leves, relaxamento
ru: Незначительные изменения настроения, расслабление
zh: 轻微的情绪变化，放松

source: Some loss of judgment
ar: بعض فقدان الحكم
de: Einige Verlust des Urteilsvermögens
es: Alguna pérdida de juicio
fr: Perte de jugement
hi: कुछ निर्णय क्षमता में कमी
ja: 判断力の一部喪失
ko: 일부 판단력 손실
pt: Alguma perda de julgamento
ru: Некоторое снижение суждения
zh: 一些判断力下降

# exaggeratedBehavior
source: Exaggerated behavior, impaired judgment
ar: سلوك مبالغ فيه، ضعف الحكم
de: Übertriebenes Verhalten, beeinträchtigtes Urteilsvermögen
es: Comportamiento exagerado, juicio afectado
fr: Comportement exagéré, jugement altéré
hi: अतिशयोक्तिपूर्ण व्यवहार, निर्णय में कमी
ja: 誇張された行動、判断力の低下
ko: 과장된 행동, 판단력 저하
pt: Comportamento exagerado, julgamento prejudicado
ru: Преувеличенное поведение, ухудшение суждения
zh: 行为夸张，判断力受损

# reducedCoordination
source: Reduced coordination, alertness
ar: تنسيق منخفض، يقظة
de: Verminderte Koordination, Wachsamkeit
es: Coordinación reducida, alerta
fr: Coordination réduite, vigilance
hi: सामंजस्य में कमी, सतर्कता
ja: 協調性の低下、警戒心
ko: 조정력 감소, 경계
pt: Coordenação reduzida, alerta
ru: Сниженная координация, бдительность
zh: 协调性下降，警觉性降低

# muscleCoordinationPoor
source: Muscle coordination becomes poor
ar: تنسيق العضلات ضعيف
de: Schlechte Muskelkoordination
es: La coordinación muscular se vuelve deficiente
fr: Coordination musculaire médiocre
hi: पेशी सामंजस्य खराब
ja: 筋肉の協調性が悪い
ko: 근육 조정력이 좋지 않음
pt: Coordenação muscular pobre
ru: Плохая координация мышц
zh: 肌肉协调性差

# legalDrivingLimit
source: Legal driving limit in most jurisdictions
ar: الحد القانوني للقيادة في معظم الولايات
de: Rechtlicher Fahrgrenzwert in den meisten Gerichtsbarkeiten
es: Límite legal de conducción en la mayoría de las jurisdicciones
fr: Limite légale de conduite dans la plupart des juridictions
hi: अधिकांश क्षेत्रों में कानूनी ड्राइविंग सीमा
ja: ほとんどの管轄区域での法定運転制限
ko: 대부분의 관할권에서의 법적 운전 한도
pt: Limite legal de condução na maioria das jurisdições
ru: Законный предел скорости в большинстве юрисдикций
zh: 大多数地区的合法驾驶限制

# balanceSpeechVisionImpaired
source: Balance, speech, vision severely impaired
ar: توازن، كلام، رؤية متضررة بشدة
de: Gleichgewicht, Sprache, Sicht stark beeinträchtigt
es: Equilibrio, habla, visión gravemente afectados
fr: Équilibre, parole, vision gravement altérés
hi: संतुलन, भाषण, दृष्टि गंभीर रूप से प्रभावित
ja: バランス、スピーチ、視覚が深刻に影響を受ける
ko: 균형, 언어, 시각이 심각하게 손상됨
pt: Equilíbrio, fala, visão gravemente afetados
ru: Баланс, речь, зрение серьезно нарушены
zh: 平衡、语言、视力严重受损

source: Potential loss of consciousness
ar: فقدان محتمل للوعي
de: Potenzielle Bewusstlosigkeit
es: Pérdida potencial de conciencia
fr: Perte potentielle de conscience
hi: संवेदनशीलता की संभावित हानि
ja: 意識喪失の可能性
ko: 의식 상실 가능성
pt: Perda potencial de consciência
ru: Потенциальная потеря сознания
zh: 潜在失去意识

source: Risk of alcohol poisoning
ar: خطر التسمم بالكحول
de: Risiko einer Alkoholvergiftung
es: Riesgo de intoxicación por alcohol
fr: Risque d'intoxication alcoolique
hi: शराब विषाक्तता का जोखिम
ja: アルコール中毒のリスク
ko: 알코올 중독 위험
pt: Risco de intoxicação alcoólica
ru: Риск алкогольного отравления
zh: 酒精中毒风险

source: Hypotension
ar: انخفاض ضغط الدم
de: Hypotonie
es: Hipotensión
hi: निम्न रक्तचाप
ja: 低血圧
ko: 저혈압
pt: Hipotensão
ru: Гипотония
zh: 低血压

source: Elevated
ar: مرتفع
de: Erhöht
es: Elevado
fr: Élevé
hi: उच्च
ja: 上昇
ko: 상승
pt: Elevado
ru: Повышенный
zh: 升高

source: Hypertension Stage 1
ar: ارتفاع ضغط الدم المرحلة 1
de: Hypertonie Stadium 1
es: Hipertensión etapa 1
fr: Hypertension stade 1
hi: हाई ब्लड प्रेशर स्टेज 1
ja: 高血圧ステージ1
ko: 고혈압 1단계
pt: Hipertensão estágio 1
ru: Гипертония стадия 1
zh: 高血压阶段1

source: Hypertension Stage 2
ar: ارتفاع ضغط الدم المرحلة 2
de: Hypertonie Stadium 2
es: Hipertensión etapa 2
fr: Hypertension stade 2
hi: हाई ब्लड प्रेशर स्टेज 2
ja: 高血圧ステージ2
ko: 고혈압 2단계
pt: Hipertensão estágio 2
ru: Гипертония стадия 2
zh: 高血压阶段2

source: Hypertensive Crisis
ar: أزمة ارتفاع ضغط الدم
de: Hypertensiver Krisen
es: Crisis hipertensiva
fr: Crise hypertensive
hi: हाइपरटेंसिव संकट
ja: 高血圧危機
ko: 고혈압 위기
pt: Crise hipertensiva
ru: Гипертонический криз
zh: 高血压危机

# riskOfDizziness
source: Risk of dizziness, fainting, and potential organ damage
ar: خطر الدوخة، الإغماء، وإمكانية تلف الأعضاء
de: Risiko von Schwindel, Ohnmacht und potenziellen Organschäden
es: Riesgo de mareos, desmayos y daño potencial a órganos
fr: Risque de vertiges, d'évanouissements et de dommages potentiels aux organes
hi: चक्कर, बेहोशी और संभावित अंग क्षति का जोखिम
ja: めまい、失神、潜在的な臓器損傷のリスク
ko: 어지러움, 기절 및 잠재적인 장기 손상의 위험
pt: Risco de tontura, desmaios e danos potenciais aos órgãos
ru: Риск головокружения, обморока и потенциального повреждения органов
zh: 头晕、晕厥和潜在器官损伤的风险

# lowestRisk
source: Lowest risk of heart disease and stroke
ar: أدنى خطر للإصابة بأمراض القلب والسكتة الدماغية
de: Geringstes Risiko für Herzkrankheiten und Schlaganfälle
es: Menor riesgo de enfermedades cardíacas y accidentes cerebrovasculares
fr: Risque le plus bas de maladies cardiaques et d'accidents vasculaires cérébraux
hi: हृदय रोग और स्ट्रोक का न्यूनतम जोखिम
ja: 心臓病や脳卒中のリスクが最も低い
ko: 심장병 및 뇌졸중의 가장 낮은 위험
pt: Menor risco de doenças cardíacas e derrames
ru: Наименьший риск сердечно-сосудистых заболеваний и инсульта
zh: 心脏病和中风的最低风险

# increasedRisk
source: Increased risk of developing hypertension
ar: زيادة خطر الإصابة بارتفاع ضغط الدم
de: Erhöhtes Risiko für die Entwicklung von Hypertonie
es: Aumento del riesgo de desarrollar hipertensión
fr: Risque accru de développer une hypertension
hi: हाई ब्लड प्रेशर विकसित करने का जोखिम बढ़ गया है
ja: 高血圧を発症するリスクが増加
ko: 고혈압 발병 위험 증가
pt: Aumento do risco de desenvolver hipertensão
ru: Повышенный риск развития гипертонии
zh: 发展高血压的风险增加

# moderateRisk
source: Moderate risk of heart disease and stroke
ar: خطر متوسط للإصابة بأمراض القلب والسكتة الدماغية
de: Mäßiges Risiko für Herzkrankheiten und Schlaganfälle
es: Riesgo moderado de enfermedades cardíacas y accidentes cerebrovasculares
fr: Risque modéré de maladies cardiaques et d'accidents vasculaires cérébraux
hi: हृदय रोग और स्ट्रोक का मध्यम जोखिम
ja: 心臓病や脳卒中の中程度のリスク
ko: 심장병 및 뇌졸중의 중간 위험
pt: Risco moderado de doenças cardíacas e derrames
ru: Умеренный риск сердечно-сосудистых заболеваний и инсульта
zh: 心脏病和中风的中等风险

# highRisk
source: High risk of heart disease, stroke, and organ damage
ar: خطر عالٍ للإصابة بأمراض القلب والسكتة الدماغية وتلف الأعضاء
de: Hohes Risiko für Herzkrankheiten, Schlaganfälle und Organschäden
es: Alto riesgo de enfermedades cardíacas, accidentes cerebrovasculares y daño a órganos
fr: Risque élevé de maladies cardiaques, d'accidents vasculaires cérébraux et de dommages aux organes
hi: हृदय रोग, स्ट्रोक और अंग क्षति का उच्च जोखिम
ja: 心臓病、脳卒中、臓器損傷のリスクが高い
ko: 심장병, 뇌졸중 및 장기 손상의 높은 위험
pt: Alto risco de doenças cardíacas, derrames e danos aos órgãos
ru: Высокий риск сердечно-сосудистых заболеваний, инсульта и повреждения органов
zh: 心脏病、中风和器官损伤的高风险

# extremelyHighRisk
source: Extremely high risk of heart attack, stroke, and organ failure
ar: خطر مرتفع للغاية للإصابة بنوبة قلبية أو سكتة دماغية أو فشل الأعضاء
de: Extrem hohes Risiko für Herzinfarkt, Schlaganfall und Organversagen
es: Riesgo extremadamente alto de ataque cardíaco, accidente cerebrovascular y fallo orgánico
fr: Risque extrêmement élevé de crise cardiaque, d'accident vasculaire cérébral et d'insuffisance organique
hi: दिल का दौरा, स्ट्रोक और अंगों की विफलता का अत्यधिक उच्च जोखिम
ja: 心臓発作、脳卒中、臓器不全のリスクが非常に高い
ko: 심장마비, 뇌졸중 및 장기 부전의 매우 높은 위험
pt: Risco extremamente alto de ataque cardíaco, derrame e falência de órgãos
ru: Чрезвычайно высокий риск сердечного приступа, инсульта и органной недостаточности
zh: 心脏病发作、中风和器官衰竭的极高风险

source: Abnormally Low
ar: منخفض بشكل غير طبيعي
de: Abnorm niedrig
es: Anormalmente bajo
fr: Anormalement bas
hi: असामान्य रूप से कम
ja: 異常に低い
ko: 비정상적으로 낮음
pt: Anormalmente baixo
ru: Аномально низкий
zh: 异常低

source: Slightly Elevated
ar: مرتفع قليلاً
de: Leicht erhöht
es: Ligeramente elevado
fr: Légèrement élevé
hi: थोड़ा ऊँचा
ja: わずかに上昇
ko: 약간 상승
pt: Levemente elevado
ru: Немного повышенный
zh: 稍微升高

source: Abnormally High
ar: مرتفع بشكل غير طبيعي
de: Abnorm hoch
es: Anormalmente alto
fr: Anormalement élevé
hi: असामान्य रूप से उच्च
ja: 異常に高い
ko: 비정상적으로 높음
pt: Anormalmente alto
ru: Аномально высокий
zh: 异常高

# unusuallyLowBreathing
source: Unusually low breathing rate. Consult a healthcare professional.
ar: معدل التنفس غير طبيعي. يرجى استشارة أخصائي الرعاية الصحية.
de: Ungewöhnlich niedrige Atemfrequenz. Bitte konsultieren Sie einen Gesundheitsdienstleister.
es: Tasa de respiración inusualmente baja. Consulte a un profesional de salud.
fr: Taux de respiration anormalement bas. Consultez un professionnel de santé.
hi: असामान्य रूप से कम श्वास दर। कृपया चिकित्सा पेशेवर से परामर्श करें।
ja: 異常に低い呼吸率。医療専門家に相談してください。
ko: 비정상적으로 낮은 호흡률. 의료 전문가와 상담하십시오.
pt: Taxa de respiração anormalmente baixa. Consulte um profissional de saúde.
ru: Аномально низкая частота дыхания. Обратитесь к медицинскому специалисту.
zh: 呼吸率异常低。请咨询医疗专业人员。

# healthyBreathing
source: Your breathing rate is within the healthy range.
ar: معدل التنفس لديك ضمن النطاق الصحي.
de: Ihre Atemfrequenz liegt im gesunden Bereich.
es: Su tasa de respiración está dentro del rango saludable.
fr: Votre taux de respiration est dans la plage saine.
hi: आपकी श्वास दर स्वस्थ सीमा में है।
ja: あなたの呼吸率は健康的な範囲内です。
ko: 당신의 호흡률은 건강한 범위 내에 있습니다.
pt: Sua taxa de respiração está dentro da faixa saudável.
ru: Ваша частота дыхания в пределах нормы.
zh: 您的呼吸率在健康范围内。

# slightlyHigherBreathing
source: Your breathing rate is slightly higher than normal.
ar: معدل التنفس لديك أعلى قليلاً من الطبيعي.
de: Ihre Atemfrequenz ist leicht höher als normal.
es: Su tasa de respiración es ligeramente más alta de lo normal.
fr: Votre taux de respiration est légèrement supérieur à la normale.
hi: आपकी श्वास दर सामान्य से थोड़ी अधिक है।
ja: あなたの呼吸率は通常よりわずかに高いです。
ko: 당신의 호흡률은 정상보다 약간 높습니다.
pt: Sua taxa de respiração está ligeiramente acima do normal.
ru: Ваша частота дыхания немного выше нормы.
zh: 您的呼吸率略高于正常水平。

# unusuallyHighBreathing
source: Unusually high breathing rate. Consult a healthcare professional.
ar: معدل التنفس غير طبيعي. يرجى استشارة أخصائي الرعاية الصحية.
de: Ungewöhnlich hohe Atemfrequenz. Bitte konsultieren Sie einen Gesundheitsdienstleister.
es: Tasa de respiración inusualmente alta. Consulte a un profesional de salud.
fr: Taux de respiration anormalement élevé. Consultez un professionnel de santé.
hi: असामान्य रूप से उच्च श्वास दर। कृपया चिकित्सा पेशेवर से परामर्श करें।
ja: 異常に高い呼吸率。医療専門家に相談してください。
ko: 비정상적으로 높은 호흡률. 의료 전문가와 상담하십시오.
pt: Taxa de respiração anormalmente alta. Consulte um profissional de saúde.
ru: Аномально высокая частота дыхания. Обратитесь к медицинскому специалисту.
zh: 呼吸率异常高。请咨询医疗专业人员。

source: Significant risk of injury
ar: خطر كبير للإصابة
de: Signifikantes Verletzungsrisiko
es: Riesgo significativo de lesiones
fr: Risque significatif de blessure
hi: चोट का महत्वपूर्ण जोखिम
ja: 重大な怪我のリスク
ko: 중대한 부상 위험
pt: Risco significativo de lesão
ru: Значительный риск травмы
zh: 显著的受伤风险

source: Dark Mode
ar: الوضع المظلم
de: Dunkler Modus
es: Modo oscuro
fr: Mode sombre
hi: अंधेरा मोड
ja: ダークモード
ko: 다크 모드
pt: Modo escuro
ru: Темный режим
zh: 黑暗模式
